//RAKUMOD4 JOB (SYSGEN),'ZJW0004',
//             CLASS=A,
//             MSGCLASS=H,
//             MSGLEVEL=(1,1),
//             REGION=4096K,
//             USER=IBMUSER,PASSWORD=SYS1
/*JOBPARM LINES=100
//ZJW00041 EXEC SMPREC
//SMPPTFIN DD  *
++USERMOD (ZJW0004).
++VER (Z038) FMID(EBB1102) PRE(ZJW0003).
++MACUPD(SGIEE0MS).
./ CHANGE NAME=SGIEE0MS
         DC    CL80'//RAKFSHAD DD DSN=SYS1.SECURE.SHADOW,'              04870016
         DC    CL80'//            DISP=SHR'                             04870017
/*
//SMPCNTL  DD  *
 /* REJECT  SELECT(ZJW0004). */
 RESETRC
 .
 RECEIVE SELECT(ZJW0004)
 .
/*
//ZJW00042   EXEC SMPAPP
//AMODGEN  DD  DISP=SHR,DSN=SYS1.AMODGEN
//SMPCNTL  DD  *
 APPLY   SELECT(ZJW0004)
         DIS(WRITE)
 .
/*
