//RAKFPROF EXEC PGM=RAKFPROF                                            00010000
//RAKFPROF DD DSN=SYS1.SECURE.CNTL(PROFILES),DISP=SHR                   00020000
