//RAKFPWUP EXEC PGM=RAKFPWUP                                            00000100
//RAKFPWUP  DD  DSN=SYS1.SECURE.PWUP,DISP=OLD                           00000200
//RAKFUSER  DD  DSN=SYS1.SECURE.CNTL(USERS),DISP=SHR                    00000300
//RAKFSHAD  DD  DSN=SYS1.SECURE.SHADOW,DISP=OLD                         00000400
