         TITLE 'ESG-SECURITY USERID TABLE LOADER'                       00000100
* CPARM='XREF(SHORT)',LPARM='AC=1'                            CJYRUIDS  00000200
*      DD DSN=SYS1.MACLIB,DISP=SHR                                      00000300
*      DD DSN=SYS1.MODGEN,DISP=SHR                                      00000400
*      DD DSN=RAKF.MACLIB,DISP=SHR                                      00000500
         EJECT                                                          00000600
CJYRUIDS CSECT                                                          00000700
*                                                                       00000800
**********************************************************************  00000900
*                                                                    *  00001000
*    COPYRIGHT (C) 1991 BY CRAIG J. YASUNA.  ALL RIGHTS RESERVED.    *  00001100
*                                                                    *  00001200
*    THIS SOFTWARE PRODUCT OR ANY OF ITS COMPONENTS MUST NOT BE      *  00001300
*    SOLD, GIVEN, OR OTHERWISE DISTRIBUTED TO ANY OTHER COMPANY      *  00001400
*    WITHOUT THE PRIOR WRITTEN PERMISSION OF:                        *  00001500
*                                                                    *  00001600
*                                  CRAIG J. YASUNA, PRESIDENT        *  00001700
*                                  ENTERPRISE SYSTEMS GROUP          *  00001800
*                                  2 MARC COURT                      *  00001900
*                                  EDISON, NEW JERSEY 08820          *  00002000
*    Function:                                                       *  00002100
*    Read SYS1.SECURE.CNTL(USERS) and create the User's table with   *  00002200
*    connected groups.                                               *  00002300
*    Call RAKFPSAV to check if SYS1.SECURE.PWUP contains pending     *  00002400
*    password changes and update these passwords.                    *  00002500
*                                                                    *  00002600
*   !!!!! DO NOT RENUMBER !!!!! enter NUMBER OFF before editing      *  00002700
*                               But better is letting SMP doing      *  00002800
*                               the EDIT.                            *  00002900
*                                                                    *  00003000
**********************************************************************  00003100
*                                                                   @01 00003200
*    Change History                                                 @01 00003300
*                                                                   @01 00003400
*    2011/04/03 TRKF120 base version                                @01 00003500
*    2011/04/18 RRKF001 introduce change history                    @01 00003600
*                       enable comment lines in UDATA and PDATA     @01 00003700
*                       consistently don't specify msg descriptor   @01 00003800
*                       fix S378 after error in first line of UDATA @01 00003900
*                       add missing DEQ for SECURITY,USERS          @01 00004000
*    2011/04/26 RRKF002 enable end users to change their passwords  @02 00004100
*                       permanently: Before updating the incore     @02 00004200
*                       users table RAKFUSER calls RAKFPSAV to      @02 00004300
*                       update UDATA with the temporary password    @02 00004400
*                       changes queued since the previous execution @02 00004500
*    2011/04/29 RRKF003 if in-core UDATA table already exists check @03 00004600
*                       for READ access to profile RAKFADM in the   @03 00004700
*                       FACILITY class to ensure that only properly @03 00004800
*                       authorized users can replace the in-core    @03 00004900
*                       UDATA table                                 @03 00005000
*                                                                   @03 00005100
*    2026/02/28 RRKF004 The user table was stored in unprotected    @04 00005200
*                       memory, meaning anyone with access to the   @04 00005300
*                       LPAR could dump that table and reverse all  @04 00005400
*                       the users information and their password    @04 00005500
*                       Now those user tables reside in fetch       @04 00005600
*                       protected memory                            @04 00005700
*    2022/10/21 RRKF007 Remove the need to sort the input in        @07 00005800
*                       alphabetical order. Allocate a core table   @07 00005900
*                       of 1,000 entries, read the USERS member     @07 00006000
*                       into this table and sort the table          @07 00006100
*                       before processing.                          @07 00006200
*    2026/03/01         Moving CBLK to fetch protected storage, so  @07 00006300
*                       users can't dump the user table,            @07 00006400
*                       tested logon with FTP, TSO and JOB card.    @07 00006500
*                       Everything seems to work.                   @07 00006600
*    2026/10/01 @rp2    Move SPECIAL flag to Users core table      @rp2 00006700
********************************************************************@07 00006800
*                                                                       00006900
         SAVE   (14,12),,CJYRUIDS_&SYSDATE._&SYSTIME                    00007000
         LR     R12,R15             USE ENTRY AS BASE                   00007100
         USING  CJYRUIDS,R12        " " "                               00007200
         ST     R13,SAVEAREA+4      SAVE CALLER'S SAVE AREA ADDR        00007300
         LA     R2,SAVEAREA         OUR SAVEAREA                        00007400
         ST     R2,8(R13)           SAVE OUR AREA                       00007500
         LR     R13,R2              LOAD REGISTER 13 WITH SAVEAREA      00007600
*                                                                       00007700
         L      R8,FLCCVT-PSA(0)    GET CVT ADDR                        00007800
         ICM    R8,B'1111',CVTRAC-CVTMAP(R8) GET RCVT ADDR, IS IT 0?    00007900
         BZ     ABEND100             Y - CJYRCVT FAILED, GO TO ABEND    00008000
         ICM    R8,B'1111',RCVTISTL-RCVT(R8) GET OUR POINTER, IS IT 0?  00008100
         BZ     ABEND100             YES, ABEND                         00008200
*                                                                   @03 00008300
         ICM    R5,B'0111',CJYUSERS-CJYRCVTD(R8) does UDATA exist?  @03 00008400
         BZ     OK2GO                NO, go ahead                   @03 00008500
         RACHECK ENTITY=RAKFADM,CLASS='FACILITY',ATTR=READ authorize@03 00008600
         LTR    R15,R15             RAKFADM granted?                @03 00008700
         BNZ    ABEND600             NO, abend                      @03 00008800
*                                                                   @03 00008900
OK2GO    ENQ    (SECURITY,USERS,E,,SYSTEM),RET=HAVE serialization   @03 00009000
*                                                                   @02 00009100
         L      R15,RAKFPSAV        get password changer address    @02 00009200
         BALR   R14,R15             call it                         @02 00009300
*                                                                   @02 00009400
         OPEN   (CJYUDATA,(INPUT))  OPEN INPUT FILE                     00009500
         MODESET MODE=SUP,KEY=ZERO  authorize ourselves                 00009600
         XR     R5,R5               initialize GM chain             @01 00009700
*                                                                   @07 00009800
         GETMAIN RU,LV=80000           GETMAIN ROOM FOR 1000 ENT.   @07 00009900
         LR    R2,R1                   SAVE ITS ADDRESS             @07 00010000
         ST    R1,ADRTBL               SAVE FOR LATER USE           @07 00010100
         XR    R9,R9                   RECORD COUNTER               @07 00010200
GETMLOOP DS    0H                                                   @07 00010300
         XC    0(80,R2),0(R2)          CLEAR CORE TABLE ENTRY       @07 00010400
         GET   CJYUDATA,RECORD         READ A RECORD                @07 00010500
         CLI   USERID,C'*'             COMMENT FIELD?               @07 00010600
         BE    GETMLOOP                YES: SKIP                    @07 00010700
         MVC   0(80,R2),RECORD         MOVE IN TEMPORARY TABLE      @07 00010800
         LA    R9,1(,R9)               INCREASE COUNTER             @07 00010900
         LA    R2,80(,R2)              NEXT ENTRY IN TABLE          @07 00011000
         B     GETMLOOP                READ NEXT RECORD             @07 00011100
ENDLOOP  DS    0H                                                   @07 00011200
         L     R2,ADRTBL               POINT TO FIRST RECORD        @07 00011300
         ICM   R1,15,0(R2)             NO DATA?                     @07 00011400
         BZ    ABEND300            Y - TELL ABOUT IT AND TERMINATE. @07 00011500
         STM   R4,R8,SAVESORT                                       @07 00011600
         CH    R9,=H'2'                LESS THAN 2 RECORDS?         @07 00011700
         BL    READLOOP                DO NOT SORT                  @07 00011800
         BCTR  R9,0                    MINUS 1                      @07 00011900
         MH    R9,=H'80'               ** RECORD LENGTH             @07 00012000
         LA    R7,0(R2,R9)             POINT TO LAST RECORD         @07 00012100
*                                                                   @07 00012200
SORT01   DS    0H                      START SORT                   @07 00012300
         ST    R7,SWAPLAST             LAST RECORD SWAPPED          @07 00012400
         L     R4,ADRTBL               POINT TO FIRST RECORD        @07 00012500
         LR    R5,R4                   NEXT                         @07 00012600
         LA    R5,80(,R4)                   RECORD                  @07 00012700
SORT03   DS    0H                      SORT TEMPORARY TABLE         @07 00012800
         CL    R4,SWAPLAST             LAST RECORD REACHED?         @07 00012900
         BNL   SORT07                  YES: LOOP COMPLETE           @07 00013000
         CLC   0(80,R4),0(R5)          COMPARE                      @07 00013100
         BNH   SORT05                  HIGH: SWAP THESE RECORDS     @07 00013200
         XC    0(80,R4),0(R5)          SWAP                         @07 00013300
         XC    0(80,R5),0(R4)              THE                      @07 00013400
         XC    0(80,R4),0(R5)                   RECORDS             @07 00013500
         LR    R7,R4                   LAST RECORD SWAPPED IN R7    @07 00013600
SORT05   DS    0H                      LOAD NEXT ENTRY              @07 00013700
         LA    R4,80(,R4)              NEXT RECORD                  @07 00013800
         LA    R5,80(,R5)              NEXT RECORD                  @07 00013900
         B     SORT03                  COMPARE NEXT RECORD          @07 00014000
SORT07   DS    0H                      ALL RECORDS DONE             @07 00014100
         CL    R7,SWAPLAST             ARE THESE SWAPS EXECUTED?    @07 00014200
         BL    SORT01                  IF YES, THEN SORT AGAIN      @07 00014300
*                                      ELSE END OF SORT             @07 00014400
         L     R9,ADRTBL               START OF CORE TABLE          @07 00014500
         SL    R9,=F'80'               POINT 1 RECORD BEFORE        @07 00014600
         LM    R4,R8,SAVESORT          RESTORE REGISTERS            @07 00014700
*                                                                       00014800
*        read the shadow (salt+hash) table into storage                 00014900
         OPEN   (SHADOW,(INPUT))       Open shadow dataset              00015000
         GETMAIN RU,LV=48000           Room for 1000 shadow entries     00015100
         LR     R2,R1                  Table address                    00015200
         ST     R1,ADRSHAD             Save address SHADOW table        00015300
         XR     R3,R3                  Counter of SHADOW records        00015400
SHADRLP  GET    SHADOW,(R2)            Read a shadow record (48 bytes)  00015500
         LA     R2,48(,R2)             Next slot in SHADOW table        00015600
         LA     R3,1(,R3)              Count it                         00015700
         B      SHADRLP                Read next SHADOW record          00015800
SHADEOD  ST     R3,SHADCNT             Save counter                     00015900
         CLOSE  (SHADOW)               Close shadow dataset             00016000
*                                                                       00016100
READLOOP LA    R9,80(,R9)              NEXT RECORD IN TABLE         @07 00016200
         ICM   R1,15,0(R9)             END OF DATA?                 @07 00016300
         BZ    ENDDATA                 Y: ENTIRE TABLE PROCESSED    @07 00016400
         MVC   RECORD,0(R9)            MOVE ENTRY                   @07 00016500
         CLC   USERID,OLDUSER          IS INPUT IN SORT SEQUENCE?       00016600
         BE    NEWGROUP              Same USER, check for new group @01 00016700
*        BNH   ABEND2                Not in sort seq, tell about it @01 00016800
         CLI   USERID,C' '             UserID specified?                00016900
         BE    ABEND2                  No: abend                        00017000
         CLI   GROUP,C' '              Group name specified?            00017100
         BE    ABEND2                  No: abend                        00017200
         CLI   OPERFLAG,C'Y'           Operations set?                  00017300
         BE    SPECIAL                 Yes: good                        00017400
         CLI   OPERFLAG,C'N'           Nooperations set?                00017500
         BNE   ABEND2                  No: abend                        00017600
SPECIAL  CLI   SPECFLAG,C'Y'           SPECIAL flag set?                00017700
         BE    RECOK                   Yes: good                        00017800
         MVI   SPECFLAG,C'N'           Else set NOSPECIAL               00017900
*                                                                       00018000
RECOK    MVC    OLDREC,RECORD       REFRESH LAST USER ID READ           00018100
         GETMAIN RU,LV=CBLKL,SP=231 GET AREA IN FETCH-PROTECTED CSA @07 00018200
         LR     R5,R1               GM AREA ADDR TO WORK REG.           00018300
         USING  CBLK,R5             HELLO BALL ---                      00018400
         XC     CBLK(CBLKL),CBLK    CLEAR TO B'0'                       00018500
         MVC    CBLKNEXT,LASTGM     GET PREV GETMAINED ADDR.            00018600
         ST     R5,LASTGM           SAVE ADDR OF GM AREA.               00018700
         LA     R7,CBLKGRPS        POINTER FOR GROUP                    00018800
*                                                                       00018900
         LA     R1,8               MAX                                  00019000
         TRT    USERID,TRTBLANK    FIND BLANK                           00019100
         BZ     MOVEUID            GO MOVE USERID                       00019200
         S      R1,=A(USERID)      SUBTRACT BEGINNING                   00019300
MOVEUID  STC    R1,CBLKUSRL        SAVE LENGTH                          00019400
         MVC    CBLKUSRI,USERID    MOVE USERID                          00019500
*                                                                       00019600
         LA     R1,8               MAX                                  00019700
         TRT    GROUP,TRTBLANK     FIND BLANK                           00019800
         BZ     MOVEGRP            GO MOVE GROUP                        00019900
         S      R1,=A(GROUP)       SUBTRACT BEGINNING                   00020000
MOVEGRP  STC    R1,CBLKGRPL        SAVE LENGTH                          00020100
         MVC    CBLKGRPN,GROUP     MOVE GROUP                           00020200
*---------------------------------------------------------------------* 00020300
*        Look up salt+hash for this UserID in the shadow table          00020400
*---------------------------------------------------------------------* 00020500
         L      R2,ADRSHAD         Address of shadow table              00020600
         L      R3,SHADCNT         Number of shadow entries             00020700
         LTR    R3,R3              Any entries?                         00020800
         BZ     MOVENOSH           No -> zero hash (login denied)       00020900
MOVESHLP CLC    0(8,R2),USERID     UserID match?                        00021000
         BE     MOVESHFN           Yes, found                           00021100
         LA     R2,48(,R2)         Next shadow entry                    00021200
         BCT    R3,MOVESHLP        Check next                           00021300
         B      MOVENOSH           Not found -> zero hash               00021400
MOVESHFN MVC    CBLKSALT,8(R2)     Copy salt (8 bytes)                  00021500
         MVC    CBLKHASH,16(R2)    Copy hash (32 bytes)                 00021600
         B      MOVEOPER                                                00021700
MOVENOSH XC     CBLKSALT,CBLKSALT  no salt                              00021800
         XC     CBLKHASH,CBLKHASH  no hash -> nothing matches           00021900
MOVEOPER MVC    CBLKFLG1,OPERFLAG  MOVE OPER FLAG TO ENTRY.             00022000
         MVC    CBLKSPEC,SPECFLAG  Move SPECIAL attribute if there @rp2 00022100
*                                                                       00022200
         B      ADDGROUP           ADD CONNECTS                         00022300
*                                                                       00022400
NEWGROUP CLC    GROUP,OLDGROUP      IS INPUT IN SORT SEQUENCE?          00022500
*        BNH    ABEND2                 N - TELL ABOUT IT                00022600
         MVC    OLDREC,RECORD       REFRESH LAST USER ID READ           00022700
ADDGROUP GETMAIN RU,LV=CONNL,SP=231 GET AREA IN FETCH-PROTECTED CSA @07 00022800
         LR     R6,R1              GM AREA ADDR TO WORK REG.            00022900
         USING  CONNGRUP,R6        HELLO BALL ---                       00023000
         XC     CONNGRUP(CONNL),CONNGRUP CLEAR AREA                     00023100
         ST     R6,0(R7)           SAVE IN LAST POINTER                 00023200
         LA     R7,CONNNEXT        SAVE FOR NEXT TIME                   00023300
*                                                                       00023400
         LA     R1,8               MAX                                  00023500
         TRT    GROUP,TRTBLANK     FIND BLANK                           00023600
         BZ     MOVECONN           GO MOVE GROUP                        00023700
         S      R1,=A(GROUP)       SUBTRACT BEGINNING                   00023800
MOVECONN STC    R1,CONNGRPL        SAVE LENGTH                          00023900
         MVC    CONNGRPN,GROUP     MOVE GROUP                           00024000
*                                                                       00024100
         CLI    DFLTGRPF,C'*'      DEFAULT FLAG SET?                    00024200
         BNE    READLOOP           NO, DON'T MOVE                       00024300
         STC    R1,CBLKGRPL        SAVE LENGTH                          00024400
         MVC    CBLKGRPN,GROUP     MOVE GROUP                           00024500
         B      READLOOP           READ NEXT RECORD.                    00024600
*                                                                       00024700
ENDDATA  OC     OLDUSER,OLDUSER    EMPTY INPUT FILE?                    00024800
         BZ     ABEND300              Y - TELL ABOUT IT AND TERMINATE.  00024900
         L      R4,CJYUSERS-CJYRCVTD(R8)       GET OLD TABLE PTR        00025000
         MVC    CJYUSERS-CJYRCVTD(,R8),LASTGM  UPDATE PTR TO NEW TABLE  00025100
         B      ANYMORE                        GO CHK FOR ANY ENTRIES.  00025200
*                                      N - FALL THROUGH                 00025300
FREELOOP L      R4,CBLKNEXT        LOOP THRU OLD TABLE                  00025400
         L      R7,CBLKGRPS-CBLK(R5)  GROUP LOOP                        00025500
         B      FREECON2                                                00025600
FREECONN L      R7,CONNNEXT        LOOP THRU OLD TABLE                  00025700
         FREEMAIN RU,LV=CONNL,A=(R6),SP=231 FREE CURRENT ENTRY.     @07 00025800
FREECON2 LTR    R6,R7              MORE ENTRIES?                        00025900
         BNZ    FREECONN               Y - NEXT ENTRY                   00026000
         FREEMAIN RU,LV=CBLKL,A=(R5),SP=231 FREE CURRENT ENTRY.     @07 00026100
ANYMORE  LTR    R5,R4              MORE ENTRIES?                        00026200
         BNZ    FREELOOP               Y - NEXT ENTRY                   00026300
*                                                                       00026400
         TM     TERMFLAG,TERMABND  WAS AN ABEND REQUESTED?              00026500
         BO     ABEND200               Y-ABEND                          00026600
         L     R2,ADRTBL               ADDRESS OF TEMP. CORE TABLE  @07 00026700
         FREEMAIN RU,LV=80000,A=(2)    RELEASE WHILE STILL KEY=0    @07 00026800
         L     R2,ADRSHAD              ADDRESS OF SHADOW TABLE          00026900
         FREEMAIN RU,LV=48000,A=(2)    RELEASE SHADOW TABLE             00027000
BYEBYE   MODESET MODE=PROB,KEY=NZERO   return to problem state          00027100
         CLOSE (CJYUDATA)              close input dataset              00027200
         DEQ   (SECURITY,USERS,,SYSTEM) release ENQ                 @01 00027300
         WTO    'RAKFUIDS4  USER TABLE UPDATED'                         00027400
         L      R13,SAVEAREA+4     LOAD CALLER'S SAVE AREA ADDR         00027500
         RETURN (14,12),RC=0                                            00027600
*                                                                       00027700
ABEND100 WTO    'RAKFUIDS1  RCVT NOT PROPERLY INITIALIZED'          @01 00027800
         WTO    'RAKFUIDSX  ** PROGRAM TERMINATED **'               @01 00027900
         ABEND  100,,STEP                                               00028000
*                                                                       00028100
ABEND2   WTO    'RAKFUIDS2  INPUT DATA INVALID OR OUT OF SEQ.'      @01 00028200
         MVC    PASSWORD,=C'********'                                   00028300
         MVC    BADMSG+8(80),RECORD                                     00028400
BADMSG   WTO    '                                                      X00028500
                                           '                        @01 00028600
         WTO    'RAKFUIDSX  ** PROGRAM TERMINATED **'               @01 00028700
         OI     TERMFLAG,TERMABND          SET TO ABEND @ TERMINATION   00028800
         LR     R4,R5                      GET LAST GM AREA ADDR AND    00028900
         B      ANYMORE                    GO CLEAN THE GM CHAIN.       00029000
*                                                                       00029100
ABEND200 ABEND  200,,STEP              Y - ABEND !                      00029200
*                                                                       00029300
ABEND300 WTO    'RAKFUIDS3  EMPTY INPUT FILE ?!?!'                  @01 00029400
         WTO    'RAKFUIDSX  ** PROGRAM TERMINATED **'               @01 00029500
         ABEND  300,,STEP                                               00029600
*                                                                   @03 00029700
ABEND600 WTO    'RAKF008W illegal operation -- access denied'       @03 00029800
         WTO    'RAKF008W   ** program terminated **'               @03 00029900
         ABEND  600,,STEP                                           @03 00030000
*                                                                       00030100
TRTBLANK DC     XL256'00'          TABLE FOR TRT                        00030200
         ORG    TRTBLANK+C' '      BLANK                                00030300
         DC     X'04'                                                   00030400
         ORG                                                            00030500
*                                                                       00030600
         PRINT  NOGEN                                                   00030700
CJYUDATA DCB    DDNAME=RAKFUSER,MACRF=GM,EODAD=ENDLOOP,DSORG=PS     @07 00030800
SHADOW   DCB    DDNAME=RAKFSHAD,MACRF=GM,EODAD=SHADEOD,DSORG=PS         00030900
*                                                                       00031000
RAKFPSAV DC     V(RAKFPSAV)        password change utility          @02 00031100
RAKFADM  DC     CL39'RAKFADM'      facility name to authorize       @03 00031200
*                                                                   @02 00031300
SAVEAREA DS     18F                                                     00031400
LASTGM   DC     F'0'                                                    00031500
SECURITY DC     CL8'CJYRCVT'                                            00031600
USERS    DC     CL8'CJYUSRS'                                            00031700
TERMFLAG DC     X'00'                                                   00031800
TERMABND EQU    X'01'                                                   00031900
RECORD   DS     0XL80                                                   00032000
USERID   DS     CL8                                                     00032100
         DS     X                                                       00032200
GROUP    DS     CL8                                                     00032300
DFLTGRPF DS     X                      Default group flag (C'*')        00032400
PASSWORD DS     CL8                    Is moved to SHADOW               00032500
         DS     X                                                       00032600
*                                                                       00032700
OPERFLAG DS     X                      OPERATIONS/NOOPERATIONS attr@rp2 00032800
         DS     X                                                  @rp2 00032900
SPECFLAG DS     X                      SPECIAL/NOSPECIAL attribute @rp2 00033000
         DS     XL(80-(*-RECORD))                                       00033100
OLDREC   DS     0XL80                                                   00033200
OLDUSER  DS     CL8                                                     00033300
         DS     X                                                       00033400
OLDGROUP DS     CL8                                                     00033500
         DS     XL(80-(*-OLDREC))                                       00033600
*                                                                       00033700
SAVESORT DS    5F                      SAVE REGISTERS SORT          @07 00033800
SWAPLAST DS    F                       LAST RECORD SWAPPED          @07 00033900
ADRTBL   DS    F                       ADDRESS OF TEMP TABLE        @07 00034000
ADRSHAD  DS    F                       ADDRESS OF SHADOW TABLE          00034100
SHADCNT  DS    F                       NUMBER OF SHADOW ENTRIES         00034200
*                                                                       00034300
R0       EQU    00                                                      00034400
R1       EQU    01                                                      00034500
R2       EQU    02                                                      00034600
R3       EQU    03                                                      00034700
R4       EQU    04                                                      00034800
R5       EQU    05                                                      00034900
R6       EQU    06                                                      00035000
R7       EQU    07                                                      00035100
R8       EQU    08                                                      00035200
R9       EQU    09                                                      00035300
R10      EQU    10                                                      00035400
R11      EQU    11                                                      00035500
R12      EQU    12                                                      00035600
R13      EQU    13                                                      00035700
R14      EQU    14                                                      00035800
R15      EQU    15                                                      00035900
*                                                                       00036000
         COPY    CJYRCVTD                                               00036100
         COPY    CJYUCBLK                                               00036200
         ICHPRCVT                                                       00036300
         CVT     DSECT=YES                                              00036400
         IHAPSA  DSECT=YES                                              00036500
*                                                                       00036600
         END                                                            00036700
