         TITLE 'INITIALIZE OUR RACF CVT'                                00000100
* CPARM='XREF(SHORT),OBJ,NODECK',LPARM='AC=1'                 CJYRCVT   00000200
*      DD DSN=SYS1.MACLIB,DISP=SHR                                      00000300
*      DD DSN=SYS1.MODGEN,DISP=SHR                                      00000400
*      DD DSN=SYS3.SAF.PARMLIB,DISP=SHR                                 00000500
         EJECT                                                          00000600
CJYRCVT  CSECT                                                          00000700
*                                                                       00000800
**********************************************************************  00000900
*                                                                    *  00001000
*    COPYRIGHT (C) 1991 BY CRAIG J. YASUNA.  ALL RIGHTS RESERVED.    *  00001100
*                                                                    *  00001200
*    THIS SOFTWARE PRODUCT OR ANY OF ITS COMPONENTS MUST NOT BE      *  00001300
*    SOLD, GIVEN, OR OTHERWISE DISTRIBUTED TO ANY OTHER COMPANY      *  00001400
*    WITHOUT THE PRIOR WRITTEN PERMISSION OF:                        *  00001500
*                                                                    *  00001600
*                                  CRAIG J. YASUNA, PRESIDENT        *  00001700
*                                  ENTERPRISE SYSTEMS GROUP          *  00001800
*                                  2 MARC COURT                      *  00001900
*                                  EDISON, NEW JERSEY 08820          *  00002000
*                                                                    *  00002100
*    Function:                                                       *  00002200
*    Initialize the RACF CVT (RCVT) with the Class Descriptor        *  00002300
*    Table, the entrypoint of the RACSTAT module to check if a       *  00002400
*    CLASS is present in the CDT and the authorized module table.    *  00002500
*    CJYRCVT is called by ICHSEC00, the initialization module of     *  00002600
*    RAKF.                                                           *  00002700
*                                                                    *  00002800
**********************************************************************  00002900
*                                                                       00003000
         PRINT NOGEN                                                    00003100
         SAVE  (14,12),,CJYRCVT_&SYSDATE._&SYSTIME                      00003200
         LR    R12,R15             USE ENTRY AS BASE                    00003300
         USING CJYRCVT,R12         " " "                                00003400
         ST    R13,SAVEAREA+4      SAVE CALLER'S SAVE AREA ADDR         00003500
         LA    R2,SAVEAREA         MY SAVEAREA                          00003600
         ST    R2,8(R13)           SAVE MY AREA                         00003700
         LR    R13,R2              LOAD REGISTER 13 WITH SAVEAREA       00003800
*                                                                       00003900
         GETMAIN RU,LV=GMLEN,SP=245 GET SQA                             00004000
         LR    R4,R1               SAVE AREA                            00004100
         LA    R5,GMLEN            LENGTH                               00004200
         LR    R6,R4               TARGET                               00004300
         LA    R7,0                ZERO FILL                            00004400
         MVCL  R4,R6               MOVE IT                              00004500
         LR    R4,R1               BRING BACK R1                        00004600
         USING RCVT,R4             ADDRESS IT                           00004700
         MVC   RCVTID,=C'RCVT'     MOVE NAME                            00004800
         MVI   RCVTVERS,X'06'      V1R6 OF RACF                         00004900
         MVI   RCVTFLG1,RCVTTAPE TAPE                                   00005000
         MVI   RCVTSTA1,X'FF'                                           00005100
         MVI   RCVTAUOP,X'7A'                                           00005200
         LA    R2,RCVTEND          POINT TO G.M. AREA AFTER RCVT        00005300
         LA    R3,CJYRCVTL         LENGTH                               00005400
         LA    R6,CJYRCVTX         POINT TO OUR CODE                    00005500
         LR    R7,R3               LENGTH EQUAL                         00005600
         MVCL  R2,R6               MOVE IT                              00005700
         LA    R2,RCVTEND          ADDRESS OF CJYRCVT                   00005800
         ST    R2,RCVTISTL         INSTALLATION POINTER                 00005900
         LA    R2,RCVTEND+RACSTAT-CJYRCVTX CDT POINTER                  00006000
         ST    R2,RCVTREXP         RACSTAT POINTER                      00006100
         LA    R2,RCVTEND+CDT-CJYRCVTX CDT POINTER                      00006200
         ST    R2,RCVTCDTP         SAVE IT                              00006300
         LA    R2,RCVTEND+ICHAUTAB-CJYRCVTX CDT POINTER                 00006400
         ST    R2,RCVTAUTP         SAVE IT                              00006500
         L     R2,FLCCVT-PSA(0)    LOAD CVT                             00006600
         ST    R4,CVTRAC-CVTMAP(R2) SAVE IN CVT                         00006700
         WTO   'RCVT WAS PROCESSED SUCCESSFULLY'                        00006800
         L     R13,SAVEAREA+4      LOAD OLD REG 13                      00006900
         RETURN (14,12),RC=0       RETURN TO CALLER                     00007000
*                                                                       00007100
         LTORG                                                          00007200
SAVEAREA DS    18F                                                      00007300
CJYRCVTX DC    XL8'0'                                                   00007400
RACSTAT  SAVE  (14,12),,RACSTAT_&SYSDATE._&SYSTIME                      00007500
*                                  Parm is a 2 word field               00007600
*                                  Word 1 receives the addr of classnm  00007700
*                                  Word 2 receives the maximum length   00007800
         DROP  ,                                                        00007900
         LR    R12,R15             USE ENTRY AS BASE                    00008000
         USING RACSTAT,R12         " " "                                00008100
         LA    R15,0               RC = 0                               00008200
         ICM   R2,B'1111',0(R1)    CLASS TO CHECK FOR                   00008300
         BZ    RETURN              NONE, RETURN                         00008400
         LA    R3,CDT              CDT                                  00008500
         LA    R4,CDTE#            NUMBER OF CDTS.                      00008600
CDTLOOP  CLC   0(8,R2),1(R3)       Class found?                         00008700
         BE    FOUNDCDT            YES, GO ON                           00008800
         LA    R3,CDTELEN(R3)      NEXT                                 00008900
         BCT   R4,CDTLOOP          GO ON                                00009000
         LA    R15,8               SORRY                                00009100
         B     RETURN              ....                                 00009200
FOUNDCDT LA    R15,0               RACF ACTIVE, CLASS ACTIVE            00009300
         XR    R2,R2               Clear length field                   00009400
         IC    R2,0(R3)            Length of class                      00009500
         ST    R2,4(,R1)           Return this to caller (ICHSFR00)     00009600
         LA    R3,1(,R3)           Point to classname                   00009700
         ST    R3,0(R1)            Save address of Class name in CDT    00009800
RETURN   RETURN (14,12),RC=(15)    BYE ...                              00009900
*                                                                       00010000
         DC    C'EYECATCHER CDT'                                        00010100
CDT      DC    AL1(39),CL8'FACILITY'                                    00010200
CDTELEN  EQU   *-CDT                                                    00010300
         DC    AL1(44),CL8'DATASET'                                     00010400
         DC    AL1(8),CL8'TSOPROC'                                      00010500
         DC    AL1(8),CL8'ACCTNUM'                                      00010600
         DC    AL1(8),CL8'PERFGRP'                                      00010700
         DC    AL1(6),CL8'DASDVOL'                                      00010800
         DC    AL1(6),CL8'TAPEVOL'                                      00010900
         DC    AL1(8),CL8'PROGRAM'                                      00011000
         DC    AL1(8),CL8'TSOAUTH'                                      00011100
         DC    AL1(8),CL8'TSOAUTH'                                      00011200
         DC    AL1(8),CL8'PROPCNTL'                                     00011300
         DC    AL1(8),CL8'TERMINAL'                                     00011400
         DC    AL1(8),CL8'APPL'                                         00011500
         DC    AL1(0),CL8' '               Free entry                   00011600
         DC    AL1(0),CL8' '               Free entry                   00011700
         DC    AL1(0),CL8' '               Free entry                   00011800
         DC    AL1(0),CL8' '               Free entry                   00011900
         DC    AL1(0),CL8' '               Free entry                   00012000
         DC    AL1(0),CL8' '               Free entry                   00012100
CDTE#    EQU   (*-CDT)/CDTELEN                                          00012200
*                                                                       00012300
ICHAUTAB DC    CL8'DSIOST',XL4'80000000'   NCCF                         00012400
         DC    CL8'DSILAR',XL4'80000000'   NCCF                         00012500
         DC    XL4'00000000'               END OF CHAIN                 00012600
*                                                                       00012700
CJYRCVTL EQU   *-CJYRCVTX                                               00012800
*                                                                       00012900
         ICHPRCVT                                                       00013000
RCVTEND  DS    0H                                                       00013100
GMLEN    EQU   *-RCVT+CJYRCVTL                                          00013200
         CVT     DSECT=YES                                              00013300
         IHAPSA  DSECT=YES                                              00013400
         IHASCVT                                                        00013500
         COPY    CJYRCVTD                                               00013600
*                                                                       00013700
R0       EQU   00                                                       00013800
R1       EQU   01                                                       00013900
R2       EQU   02                                                       00014000
R3       EQU   03                                                       00014100
R4       EQU   04                                                       00014200
R5       EQU   05                                                       00014300
R6       EQU   06                                                       00014400
R7       EQU   07                                                       00014500
R8       EQU   08                                                       00014600
R9       EQU   09                                                       00014700
R10      EQU   10                                                       00014800
R11      EQU   11                                                       00014900
R12      EQU   12                                                       00015000
R13      EQU   13                                                       00015100
R14      EQU   14                                                       00015200
R15      EQU   15                                                       00015300
         END                                                            00015400
