         TITLE 'RAKF Password Update Program'                           00000100
CJYRPWUP CSECT                                                          00000200
         PRINT NOGEN                                                    00000300
*                                                                       00000400
**********************************************************************  00000500
*                                                                    *  00000600
* NAME:  CJYRPWUP                                                    *  00000700
* ALIAS: RAKFPWUP                                                    *  00000800
*                                                                    *  00000900
* TYPE: Assembler Source                                             *  00001000
*                                                                    *  00001100
* DESC: Process Password Update Requests                             *  00001200
*                                                                    *  00001300
* FUNCTION: - Retrieve username and new password from CSA area       *  00001400
*             allocated by ICHSFR00 in subpool 227 (fetch protected) *  00001500
*           - Clear and free CSA area                                *  00001600
*           - Append username and new password to the RAKF password  *  00001700
*             change queue, a sequential dataset with LRECL=18,      *  00001800
*             RECFM=F containing one line per password change in the *  00001900
*             following format:                                      *  00002000
*                                                                    *  00002100
*             ----+----1----+---                                     *  00002200
*             uuuuuuuu pppppppp                                      *  00002300
*                                                                    *  00002400
*             Where uuuuuuuu is the username and pppppppp is the new *  00002500
*             password, each padded to the right with blanks to 8    *  00002600
*             characters.                                            *  00002700
*                                                                    *  00002800
* REQUIREMENTS: - RAKF password change queue pointed to by ddname    *  00002900
*                 RAKFPWUP using DISP=MOD in the DD statement.       *  00003000
*                                                                    *  00003100
*   !!!!! DO NOT RENUMBER !!!!! enter NUMBER OFF before editing      *  00003200
*                               But better is letting SMP doing      *  00003300
*                               the EDIT.                            *  00003400
*                                                                    *  00003500
**********************************************************************  00003600
*                                                                       00003700
* initialize                                                            00003800
*                                                                       00003900
         SAVE  (14,12),,CJYRPWUP_&SYSDATE._&SYSTIME                     00004000
         USING CJYRPWUP,R15        Establish => program EP              00004100
         ST    R13,SAVEAREA+4      Backward pointer                     00004200
         LA    R11,SAVEAREA        Establish => savearea                00004300
         ST    R11,8(,R13)         Forward pointer                      00004400
         LR    R13,R11             Setup => our savearea                00004500
         USING SAVEAREA,R13        New addressability                   00004600
         DROP  R15                 Program EP no longer needed          00004700
         B     CONTINUE            Branch around Save area              00004800
SAVEAREA DS    18F                 Save area                            00004900
*                                                                       00005000
* Begin of code                                                         00005100
*                                                                       00005200
CONTINUE LR    R5,R1               Remember PARMLIST address            00005300
         MODESET MODE=SUP,KEY=ZERO Authorize ourselves                  00005400
         L     R1,0(,R5)           Address of PARM field plist          00005500
         LH    R5,0(,R1)           Length of PARM field                 00005600
         CH    R5,=H'8'            Is PARM field length 8 characters?   00005700
         BNE   INVPARM             Talk dirty and exit if not           00005800
         MVC   ADDRHEX,2(R1)       Get PARM field in check plist        00005900
         MVC   ADDRUNPK,2(R1)      Get PARM field for translate         00006000
         TR    ADDRUNPK,HEXTBL     Translate PARM field to zoned        00006100
         PACK  ADDRESS(5),ADDRUNPK(9) Pack PARM field                   00006200
         L     R1,ADDRESS          Address storage pointed to by PARM   00006300
         CLC   0(LPWUPCMD,R1),STRTPWUP Parmlist from ICHSFR00 found?    00006400
         BNE   INVPARM             Talk dirty and exit if not           00006500
         MVC   PWUPUSER(8),PWUPUSER-STRTPWUP(R1) get user               00006600
         MVC   PWUPPSWD(8),PWUPPSWD-STRTPWUP(R1) get new password       00006700
         XC    0(LPWUP,R1),0(R1)   Clear ICHSFR00 parmlist storage      00006800
         FREEMAIN RU,LV=LPWUP,A=ADDRESS,SP=227 Free parmlist storage    00006900
         ENQ    (SECURITY,USERS,E,,SYSTEM),RET=HAVE serialization       00007000
         OPEN  (QUEUE,(OUTPUT))    Open password change queue           00007100
         PUT   QUEUE,PWUP          Write entry                          00007200
         CLOSE (QUEUE)             Close password change queue          00007300
         DEQ   (SECURITY,USERS,,SYSTEM) Release ENQ                     00007400
         MVC   SUCCESS+38(8),PWUPUSER Move user into success message    00007500
         WTO   MF=(E,SUCCESS)      Tell operator                        00007600
*                                                                       00007700
* return                                                                00007800
*                                                                       00007900
RETURN   MODESET MODE=PROB,KEY=NZERO return to problem state            00008000
         L     R13,SAVEAREA+4      Get caller's savearea                00008100
         RETURN (14,12),,RC=0      Return                               00008200
INVPARM  WTO   'RAKF006W invalid password update request ignored'       00008300
         B     RETURN                                                   00008400
*                                                                       00008500
* data area                                                             00008600
*                                                                       00008700
STRTPWUP DC    AL2(LPWUPCMD)       Parameter list that must have been.. 00008800
         DC    X'0000'               .. used to start this RAKFPWUP ..  00008900
         DC    C'S RAKFPWUP,PARM=''' .. run. This is used to perform .. 00009000
ADDRHEX  DS    CL8                   .. a validity check of the CSA ..  00009100
         DC    C''''                 .. storage addressed through ..    00009200
LPWUPCMD EQU   *-STRTPWUP            .. the PARM field                  00009300
PWUP     DS    0C                  Changes queue record                 00009400
PWUPUSER DC    CL8' '              Userid                               00009500
         DC    C' '                Filler                               00009600
PWUPPSWD DC    CL8' '              New password                         00009700
         DC    C' '                Filler                               00009800
CHGLRECL EQU   *-PWUP              Record length of changes queue       00009900
LPWUP    EQU   *-STRTPWUP          Total length of CSA area             00010000
ADDRUNPK DS    CL8                 Unpacked address                     00010100
         DC    X'C0'               sign and dummy digit                 00010200
ADDRESS  DS    F                   packed address                       00010300
         DS    X                   dummy digit and sign after pack      00010400
SECURITY DC    CL8'CJYRCVT'        Resource name for ENQ                00010500
USERS    DC    CL8'CJYUSRS'        Resource name for ENQ                00010600
QUEUE    DCB   DDNAME=RAKFPWUP,MACRF=PM,DSORG=PS password change queue  00010700
SUCCESS  WTO   'RAKF007I password update for user UUUUUUUU queued',MF=L 00010800
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       00010900
HEXTBL   DC    X'00000000000000000000000000000000' 0                    00011000
         DC    X'00000000000000000000000000000000' 1                    00011100
         DC    X'00000000000000000000000000000000' 2                    00011200
         DC    X'00000000000000000000000000000000' 3                    00011300
         DC    X'00000000000000000000000000000000' 4                    00011400
         DC    X'00000000000000000000000000000000' 5 translate table    00011500
         DC    X'00000000000000000000000000000000' 6 to convert CSA     00011600
         DC    X'00000000000000000000000000000000' 7 address from PARM  00011700
         DC    X'00000000000000000000000000000000' 8 field to zoned     00011800
         DC    X'00000000000000000000000000000000' 9 format             00011900
         DC    X'00000000000000000000000000000000' A                    00012000
         DC    X'00000000000000000000000000000000' B                    00012100
         DC    X'00FAFBFCFDFEFF000000000000000000' C                    00012200
         DC    X'00000000000000000000000000000000' D                    00012300
         DC    X'00000000000000000000000000000000' E                    00012400
         DC    X'F0F1F2F3F4F5F6F7F8F9000000000000' F                    00012500
*                                                                       00012600
* Equates                                                               00012700
*                                                                       00012800
         YREGS                     Register equates                     00012900
         END   CJYRPWUP            End of program                       00013000
