         TITLE 'RAKF Initialization Program'                            00000100
ICHSEC00 CSECT                                                          00000200
*                                                                       00000300
**********************************************************************  00000400
*                                                                    *  00000500
* NAME: ICHSEC00                                                     *  00000600
*                                                                    *  00000700
* TYPE: Assembler Source                                             *  00000800
*                                                                    *  00000900
* DESC: Initialize RAKF                                              *  00001000
*                                                                    *  00001100
* FUNCTION: - output banner to console                               *  00001200
*           - check if SAFV is already defined and initialized       *  00001300
*             o if yes: skip initialization and go directly to       *  00001400
*                       profile and user table initialization        *  00001500
*           - try to read initialization directive from              *  00001600
*             parmlib member RAKFINIT:                               *  00001700
*             o if first line of member starts with YES:    continue *  00001800
*             o if first line of member starts with NO:     exit     *  00001900
*             o else, of if member doesn't exist:                    *  00002000
*               + ask operator for permission to initialize          *  00002100
*                 if operator denies permission:            exit     *  00002200
*           - get SQA storage for SAFV and initialize it             *  00002300
*           - put entry address of SAF router ICHSFR00 in SAFV       *  00002400
*           - initialize RCVT                                        *  00002500
*           - initialize profile table                               *  00002600
*           - initialize user table                                  *  00002700
*                                                                    *  00002800
* REQUIREMENTS: - ICHSFR00 in LPA                                    *  00002900
*               - RAKFPROF and RAKFUSER in linklist                  *  00003000
*               - parmlib defined through ddname IEFPARM             *  00003100
*               - user and profile table DDs as needed               *  00003200
*                 by RAKFPROF and RAKFUSER                           *  00003300
*                                                                    *  00003400
**********************************************************************  00003500
*                                                                       00003600
         PRINT NOGEN                                                    00003700
         SAVE  (14,12),,ICHSEC00_&SYSDATE._&SYSTIME                     00003800
         USING ICHSEC00,R15        establish => program EP              00003900
         ST    R13,SAVEAREA+4      save HSA                             00004000
         LA    R11,SAVEAREA        establish => savearea                00004100
         ST    R11,8(R13)          save LSA                             00004200
         LR    R13,R11             setup => our savearea                00004300
         USING SAVEAREA,R13        new addressability                   00004400
         DROP  R15                 program EP no longer needed          00004500
         B     CONTINUE            branch around savearea               00004600
SAVEAREA DS    18F                 savearea                             00004700
*                                                                       00004800
* identify                                                              00004900
*                                                                       00005000
CONTINUE WTO   'RAKF is based on the ESG Security System'               00005100
         WTO   'written by Craig J. Yasuna               (Mar 1991)'    00005200
         WTO   'adapted to MVS 3.8J: A. Philip Dickinson (Aug 2005)'    00005300
         WTO   '                     Phil Roberts        (Apr 2011)'    00005400
         WTO   '                     Juergen Winkelmann  (Apr 2011)'    00005500
         WTO   '                     Rob Prins           (Sep 2026)'    00005600
         WTO   'RAKF V2R0M0 from https://github.com/MVS-sysgen/RAKF'    00005700
*                                                                       00005800
* RAKF already active?                                                  00005900
*                                                                       00006000
         L     R2,FLCCVT-PSA(0)    get CVT address from PSA             00006100
         ICM   R3,B'1111',CVTSAF(R2) SAFV already defined?              00006200
         BZ    GOFORIT             no RAC active, continue activation   00006300
         USING SAFV,R3             addressability of SAFV               00006400
         CLC   SAFVIDEN(4),SAFVID  SAFV initialized?                    00006500
         BNE   GOFORIT             no RAC active, continue activation   00006600
         DROP  R3                  SAFV no longer needed                00006700
         WTO   'RAKF005I RAKF is already active' tell operator          00006800
         B     PROFUSER            initialize user and profile table    00006900
*                                                                       00007000
* read parmlib                                                          00007100
*                                                                       00007200
GOFORIT  LA    R11,PARMLIB         establish ..                         00007300
         USING IHADCB,R11           .. DCB addressability               00007400
         OPEN  PARMLIB             open PARMLIB                         00007500
         LH    R12,DCBBLKSI        get blocksize                        00007600
         GETMAIN EU,LV=(R12),A=BLKADDR get storage for block            00007700
         FIND  PARMLIB,RAKFINIT,D  find member RAKFINIT                 00007800
         LTR   R15,R15             parmlib member found?                00007900
         BNZ   CLOSE                --> no, don't read                  00008000
         L     R12,BLKADDR         get block address                    00008100
         READ  INDECB,SF,PARMLIB,(R12),'S' read block                   00008200
         CHECK INDECB              wait for data to arrive              00008300
         MVC   RAKSTART(4),0(R12)  get parmlib input                    00008400
CLOSE    LH    R12,DCBBLKSI        get blocksize                        00008500
         FREEMAIN EU,LV=(R12),A=BLKADDR free storage                    00008600
         CLOSE PARMLIB             close parmlib                        00008700
         DROP  R11                 DCB no longer needed                 00008800
*                                                                       00008900
* decide initialization                                                 00009000
*                                                                       00009100
         CLC   RAKSTART(2),NO      if RAKFINIT directive is NO ..       00009200
         BE    NOINIT               .. talk dirrty and don't initialize 00009300
         CLC   RAKSTART(3),YES     if RAKFINIT directive is YES ..      00009400
         BE    INITMSG              .. initialize RAKF                  00009500
         WTO   MF=(E,INITWTO)       .. else ask operator                00009600
         WTOR  'RAKF002A Reply YES to continue or NO to cancel',       X00009700
               REPLY,4,SECECB,ROUTCDE=(1) .. shall we?                  00009800
         WAIT  ECB=SECECB          wait for reply                       00009900
         CLC   REPLY(2),NO         if operator replied NO ..            00010000
         BNE   INIT                 .. talk dirrty and don't initialize 00010100
NOINIT   WTO   'RAKF004W RAKF not initialized' tell operator            00010200
RETURN   L     R13,SAVEAREA+4      get caller's savearea                00010300
         RETURN (14,12),,RC=0      return                               00010400
*                                                                       00010500
* initialize                                                            00010600
*                                                                       00010700
INITMSG  WTO   MF=(E,INITWTO)      tell operator                        00010800
INIT     MODESET MODE=SUP,KEY=ZERO authorize ourselves                  00010900
         GETMAIN RU,LV=SAFVLEN,SP=245 get SQA storage for SAFV          00011000
         LR    R3,R1               establish ..                         00011100
         USING SAFV,R3              .. addressability of SAFV           00011200
         XC    SAFV(SAFVLEN),SAFV  clear SAFV                           00011300
         MVC   SAFVIDEN(4),SAFVID  move identifier into SAFV            00011400
         LOAD  EP=ICHSFR00         get SFR address (LPA)                00011500
         ST    R0,SAFVSAFR         store SFR address in SAFV            00011600
         DROP  R3                  SAFV addressability no longer needed 00011700
         L     R2,FLCCVT-PSA(0)    get CVT address from PSA             00011800
         ST    R3,CVTSAF(R2)       save SAFV address in CVT             00011900
         L     R15,CJYRCVT         get RCVT loader address              00012000
         BALR  R14,R15             call it                              00012100
         MODESET MODE=PROB,KEY=NZERO return to problem state            00012200
         WTO   'RAKF003I RAKF is now active',ROUTCDE=(2) tell operator  00012300
PROFUSER LOAD  EP=RAKFPROF         load profile updater                 00012400
         LR    R15,R0              address of entry point               00012500
         BALR  R14,R15             call it                              00012600
         DELETE EP=RAKFPROF        remove it                            00012700
         LOAD  EP=RAKFUSER         load user updater                    00012800
         LR    R15,R0              address of entry point               00012900
         BALR  R14,R15             call it                              00013000
         DELETE EP=RAKFUSER        remove it                            00013100
         B     RETURN              return                               00013200
*                                                                       00013300
* data area                                                             00013400
*                                                                       00013500
BLKADDR  DS    F                   address of parmlib read buffer       00013600
CJYRCVT  DC    V(CJYRCVT)          RCVT loader                          00013700
RAKFINIT DC    C'RAKFINIT'         parmlib member name                  00013800
RAKSTART DC    CL4' '              parameter read from parmlib          00013900
REPLY    DC    CL4' '              reply from operator                  00014000
SAFVID   DC    CL4'SAFV'           SAFV eye catcher                     00014100
SECECB   DC    A(0)                ECB for WTOR                         00014200
NO       DC    CL2'NO'             NO                                   00014300
YES      DC    CL3'YES'            YES                                  00014400
INITWTO  WTO   'RAKF001I RAKF is now being activated',                 X00014500
               ROUTCDE=(1),MF=L    tell operator                        00014600
PARMLIB  DCB   DDNAME=IEFPARM,DSORG=PO,MACRF=R,EODAD=CLOSE              00014700
*                                                                       00014800
* equates                                                               00014900
*                                                                       00015000
CVTSAF   EQU   248 CVTSAF doesn't exist but is a reserved field in 3.8J 00015100
         YREGS                     register equates                     00015200
*                                                                       00015300
* control block mappings                                                00015400
*                                                                       00015500
         CVT   DSECT=YES           map CVT                              00015600
         IHAPSA   DSECT=YES        map PSA                              00015700
         ICHSAFV  DSECT=YES        map SAFV                             00015800
         DCBD  DSORG=PO,DEVD=DA    map DCB                              00015900
         END   ICHSEC00                                                 00016000
