ICHSFR00 TITLE 'SAF ROUTER - ENTRY FOR ALL SECURITY CALLS'              00000100
* CPARM='XREF(SHORT),RENT,OBJ,NODECK',LPARM='RENT,REUS,MAP'   ICHSFR00  00000200
*      DD DSN=SYS1.MACLIB,DISP=SHR                                      00000300
*      DD DSN=SYS1.AMODGEN,DISP=SHR                                     00000400
*      DD DSN=RAKF.MACLIB,DISP=SHR                                      00000500
ICHSFR00 CSECT                                                          00000600
*                                                                       00000700
**********************************************************************  00000800
*                                                                    *  00000900
*    COPYRIGHT (C) 1991 BY CRAIG J. YASUNA.  ALL RIGHTS RESERVED.    *  00001000
*                                                                    *  00001100
*    THIS SOFTWARE PRODUCT OR ANY OF ITS COMPONENTS MUST NOT BE      *  00001200
*    SOLD, GIVEN, OR OTHERWISE DISTRIBUTED TO ANY OTHER COMPANY      *  00001300
*    WITHOUT THE PRIOR WRITTEN PERMISSION OF:                        *  00001400
*                                                                    *  00001500
*                                  CRAIG J. YASUNA, PRESIDENT        *  00001600
*                                  ENTERPRISE SYSTEMS GROUP          *  00001700
*                                  2 MARC COURT                      *  00001800
*                                  EDISON, NEW JERSEY 08820          *  00001900
*                                                                    *  00002000
*    Function:                                                       *  00002100
*    ICHSFR00 will be invoked from CVTSAF if a RACROUTE is used      *  00002200
*             This is a RACROUTE with the 31 bit address of the      *  00002300
*             installation data, Entity and Class.                   *  00002400
*             ICHSFR00 will be invoked by a branch entry.            *  00002500
*                           -- OR --                                 *  00002600
*    from SVC 130, SVC 131 or SVC 133 if RACHECK, FRACHECK, RACDEF   *  00002700
*    or RACINIT is issued.                                           *  00002800
*    SVC 130 = RACHECK and FRACHECK                                  *  00002900
*    SVC 131 = RACDEF                                                *  00003000
*    SVC 133 = RACINIT                                               *  00003100
*    These SVC's generates a RACROUTE in standard form.              *  00003200
*    So, ICHSFR00 will be invoked.                                   *  00003300
*                                                                    *  00003400
*    ICHSFR00 performs the following functions:                      *  00003500
*             1. RACROUTE REQUEST=VERIFY/RACINIT.                    *  00003600
*             2. RACROUTE REQUEST=AUTH/RACHECK.                      *  00003700
*             3. RACROUTE REQUEST=FASTAUTH/FRACHECK.                 *  00003800
*             4. RACROUTE REQUEST=DEFINE/RACDEF.                     *  00003900
*                                                                    *  00004000
*   !!!!! DO NOT RENUMBER !!!!! enter NUMBER OFF before editing      *  00004100
*                               But better is letting SMP doing      *  00004200
*                               the EDIT.                            *  00004300
*                                                                    *  00004400
**********************************************************************  00004500
*                                                                   @02 00004600
*    Change History                                                 @02 00004700
*                                                                   @02 00004800
*    2011/04/03 TRKF120 base version                                @02 00004900
*    2011/04/26 RRKF002 introduce change history                    @02 00005000
*                       enable end users to change their passwords  @02 00005100
*                       permanently: store user's password change   @02 00005200
*                       request in fetch protected CSA and pass the @02 00005300
*                       request address to RAKFPWUP which queues it @02 00005400
*                       for replacement in the RAKF users table     @02 00005500
*                       at next run of RAKFUSER                     @02 00005600
*                                                                   @02 00005700
*    2026/02/28 RRKF005 Two users, STC and PROD, were hard coded    @05 00005800
*                       in to RAKF with a username and password     @05 00005900
*                       added to the user table. These have since   @05 00006000
*                       been updated so that they can't be used     @05 00006100
*                       interactively, a new WTO has been added also@05 00006200
*                                                                   @02 00006300
*    2026/09/23 @mg1    Test if first qualifier really match with  @mg1 00006400
*                       UserID. Test the '.' after first qualifier @mg1 00006500
*                                                                   @02 00006600
*    2026/09/25 @rp2    The places of the ENTITY names and CLASS   @rp2 00006700
*                       in the RACF parameter list (ICHACHKL) are  @rp2 00006800
*                       differs between a RACHECK/FRACHECK         @rp2 00006900
*                       and the embedded RACF parameter list       @rp2 00007000
*                       in the RACROUTE parameter.                 @rp2 00007100
*                       Use the 31 bit addresses if a RACROUTE     @rp2 00007200
*                       macro is used (flag ACHK31IN)              @rp2 00007300
*                                                                  @rp2 00007400
*                       Invoke RACSTAT (RCVTREXP) to check if the  @rp2 00007500
*                       class is in the Class Descriptor table     @rp2 00007600
*                       (CDT) pointed to by RCVTCDTP.              @rp2 00007700
*                                                                  @rp2 00007800
*                       Permit all resources in the TAPEVOL class  @rp2 00007900
*                       if the user has the OPERATIONS authority   @rp2 00008000
*                                                                  @rp2 00008100
*                       Turn on ACEESPEC if the user has the       @rp2 00008200
*                       SPECIAL authority and move the APPL        @rp2 00008300
*                       from RACINIT into ACEEAPLN                 @rp2 00008400
*                                                                  @rp2 00008500
********************************************************************@02 00008600
*                                                                       00008700
         USING AUTHDS,R10                                               00008800
         SAVE  (14,12),,ICHSFR00.&SYSDATE..&SYSTIME                     00008900
         LR    R12,R15                                                  00009000
         LA    R11,2048(,R12)      SECOND BASE (COVERS 4096-8191)       00009100
         LA    R11,2048(,R11)      R11 = ICHSFR00 + 4096                00009200
         USING ICHSFR00,R12,R11    Base registers                  @rp2 00009300
         USING ACEE,ACEEREG        ADDRESS ACEE                         00009400
         USING PSA,0               ADDRESS PSA                          00009500
         L     R9,24(R1)           Address exit work area (WORKA)       00009600
         USING WORKSAVE,R9         ... Base our save area          @rp2 00009700
         XC    WORKAREA(WORKAREL),WORKAREA CLEAR WORKAREA               00009800
         ST    R13,WORKSAVE+4      Backward pointer                @rp2 00009900
         ST    R9,8(,R13)          Forward pointer                 @rp2 00010000
         LR    R13,R9              ADDRESS SAVE AREA                    00010100
         DROP  R9                                                       00010200
         USING WORKSAVE,R13        ... HELLO SAVE AREA                  00010300
         MVC   WORKWTO,REALWTO     MOVE WTO SKEL                        00010400
*                                                                       00010500
STRTROUT LR    R9,R1               GET ADDR. OF SAF PARAMETER LIST      00010600
         USING SAFP,R9             BASE FOR SAFP PARAMETER LIST         00010700
         LA    R2,SAFPAU           RACHECK                              00010800
         CH    R2,SAFPREQT         CHECK REQUEST TYPE                   00010900
         BE    RACHECK             YES, GO ON                           00011000
         LA    R2,SAFPFAU          FRACHECK                             00011100
         CH    R2,SAFPREQT         CHECK REQUEST TYPE                   00011200
         BE    FRACHECK            YES, GO ON                           00011300
         LA    R2,SAFPDEF          RACDEF                               00011400
         CH    R2,SAFPREQT         CHECK REQUEST TYPE                   00011500
         BE    RACDEF              YES, GO ON                           00011600
         LA    R2,SAFPVER          RACINIT                              00011700
         CH    R2,SAFPREQT         CHECK REQUEST TYPE                   00011800
         BE    RACINIT             YES, GO ON                           00011900
         LA    R2,SAFPEXT          RACXTRT                              00012000
         CH    R2,SAFPREQT         CHECK REQUEST TYPE                   00012100
         BE    RACXTRT             YES, GO ON                           00012200
         LA    R2,SAFPLIS          RACLIST                              00012300
         CH    R2,SAFPREQT         CHECK REQUEST TYPE                   00012400
         BE    RTRNGOOD            YES, GO ON                           00012500
         B     RTRN0000            GO AWAY                              00012600
         TITLE 'RACHECK PROCESSING (EXISTING RESOURCE) '                00012700
*---------------------------------------------------------------------* 00012800
*        RACHECK or RACROUTE REQUEST=AUTH from the caller.              00012900
*        If the caller uses a RACROUTE, the flag ACHK31IN is            00013000
*        set, telling you that the ENTITY and CLASS are in              00013100
*        a different place in the RACHECK parameter list.               00013200
*---------------------------------------------------------------------* 00013300
RACHECK  L     R8,SAFPRACP         OFFSET TO RACHECK PARAMETER LIST     00013400
         AR    R8,R9               ADDR. OF RACHECK PARAMETER LIST.     00013500
         USING ACHKLIST,R8                                              00013600
RACHLN31 XR    R2,R2               CLEAR R2                             00013700
         XR    ENTYREG,ENTYREG     Clear entity register           @rp2 00013800
         TM    ACHKFLG1,ACHK31IN   Are the 31 bit addresses used?  @rp2 00013900
         BZ    RACHNC31            No: take the old address        @rp2 00014000
         ICM   ENTYREG,B'1111',ACHKEN31 Get entity from 31 bit fld @rp2 00014100
         ICM   R2,B'1111',ACHKCL31 Get CLASS from 31 bit field     @rp2 00014200
         BNZ   RACHACEE            Found --> continue              @rp2 00014300
         LA    R2,RACDDSNC         use our DSN CLASS               @rp2 00014400
         B     RACHACEE            Carry on                        @rp2 00014500
RACHNC31 ICM   ENTYREG,B'0111',ACHKENT GET ENTITY                       00014600
         ICM   R2,B'0111',ACHKCLN  GET CLASS                            00014700
         BNZ   RACHACEE            found --> continue                   00014800
         LA    R2,RACDDSNC         use our DSN CLASS                    00014900
*                                                                       00015000
RACHACEE MVC   WORKCLAS,=CL8' '    BLANK IT OUT                         00015100
         IC    R1,0(R2)            Length of class                      00015200
         BCTR  R1,0                Minus 1 for EX                       00015300
         EX    R1,RACHMVCC         MVC WORKCLAS(0),1(R2)                00015400
         CLC   WORKCLAS(8),=CL8' ' CLASS blank?                         00015500
         BNE   RACHNBLK               --> no, continue                  00015600
         MVC   WORKCLAS,=CL8'DATASET' --> yes, assume DATASET           00015700
RACHNBLK ICM   ACEEREG,B'1111',ACHKACEE POINT TO ACEE                   00015800
         BNZ   RACHCHCK            NO ACEE -> ALLOW ACCES               00015900
         L     R2,PSAAOLD          OUR ASCB                             00016000
         L     R2,ASCBASXB-ASCB(R2) OUR ASXB                            00016100
         ICM   ACEEREG,B'1111',ASXBSENV-ASXB(R2) ACEE                   00016200
         BZ    RACHGOOD            WHO KNOWS                            00016300
RACHCHCK IC    R2,ACHKFLG2         GET AUTH. REQ.                       00016400
         SLL   R2,3                CONFORM TO RACDEF                    00016500
         STC   R2,WORKAUTH         SAVE IT                              00016600
         OC    WORKAUTH,ACHKFLG2   ADD BACK X'80'                       00016700
         NI    WORKAUTH,X'F0'      TURN OFF LOW ORDER                   00016800
*                                                                       00016900
         TM    ACHKFLG1,ACHKLOGS   LOG SUPPRESSED?                      00017000
         BZ    RACHCHK1            DO ENTITY CHECK                      00017100
         OI    WORKFLAG,WORKNLOG   SUPPRESS LOG                         00017200
*                                                                       00017300
RACHCHK1 BAL   R10,ENTYCHCK        GO DO ENTITY CHECK                   00017400
         B     RACHGOOD            GOOD RETURN                          00017500
         B     RACHUNKN            RC4 - UNKN                           00017600
         B     RACHFAIL            RC8 - FAIL                           00017700
RACHMVCC MVC   WORKCLAS(0),1(R2)   MOVE CLASS << executed >>            00017800
*                                                                       00017900
RACHGOOD XC    SAFPRRET,SAFPRRET   NOTHING ...                          00018000
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00018100
         B     RTRNGOOD            GO TO RC 200 CODE                    00018200
*                                                                       00018300
RACHUNKN MVC   SAFPRRET,=F'04'     NOT PROTECTED ...                    00018400
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00018500
         B     RTRNWARN            GO TO RC 204 CODE                    00018600
*                                                                       00018700
RACHFAIL MVC   SAFPRRET,=F'08'     FAIL ....                            00018800
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00018900
         B     RTRNFAIL            DO ANY EXCEPTIONS                    00019000
         TITLE 'FRACHECK PROCESSING (EXISTING RESOURCE IN-CORE) '       00019100
*---------------------------------------------------------------------* 00019200
*        FRACHECK or RACROUTE REQUEST=FASTAUTH from the caller.         00019300
*---------------------------------------------------------------------* 00019400
FRACHECK L     R8,SAFPRACP         OFFSET TO RACHECK PARAMETER LIST     00019500
         AR    R8,R9               ADDR. OF RACHECK PARAMETER LIST.     00019600
         L     R2,ACHKCLNW         Class FRACHECK                  @rp2 00019700
         LA    R2,0(,R2)           Clear high order byte           @rp2 00019800
         L     ENTYREG,ACHKENTW    Get FRACHECK entity             @rp2 00019900
         LA    ENTYREG,0(,ENTYREG) Clear high order byte           @rp2 00020000
         TM    ACHKFLG1,ACHK31IN   Invoked from RACROUTE?          @rp2 00020100
         BNO   FRACCN31            No: we are invoked from FRACHECK@rp2 00020200
         L     R2,ACHKCL31         Take 31 bit addr from RACROUTE  @rp2 00020300
         L     ENTYREG,ACHKEN31    Take 31 bit addr from RACROUTE  @rp2 00020400
FRACCN31 MVC   WORKCLAS,0(R2)      Move class                           00020500
         ICM   ACEEREG,B'1111',ACHKACEE Point to ACEE              @rp2 00020600
         BNZ   FRACCHCK            GO DO CHECK                          00020700
         L     R2,PSAAOLD          OUR ASCB                             00020800
         L     R2,ASCBASXB-ASCB(R2) OUR ASXB                            00020900
         ICM   ACEEREG,B'1111',ASXBSENV-ASXB(R2) ACEE                   00021000
         BZ    FRACUNKN            UNKNOWN                              00021100
FRACCHCK IC    R2,0(R8)            GET AUTH. REQ.                       00021200
         SLL   R2,3                CONFORM TO RACDEF                    00021300
         STC   R2,WORKAUTH         SAVE IT                              00021400
         OC    WORKAUTH,0(R8)      ADD BACK X'80'                       00021500
         NI    WORKAUTH,X'F0'      TURN OFF LOW ORDER                   00021600
         BAL   R10,ENTYCHCK        GO DO ENTITY CHECK                   00021700
         B     FRACGOOD            GOOD RETURN                          00021800
         B     FRACUNKN            RC4 - UNKN                           00021900
         B     FRACFAIL            RC8 - FAIL                           00022000
*                                                                       00022100
FRACGOOD XC    SAFPRRET,SAFPRRET   NOTHING ...                          00022200
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00022300
         B     RTRNGOOD            GO TO RC 200 CODE                    00022400
FRACUNKN MVC   SAFPRRET,=F'04'     NOT PROTECTED ...                    00022500
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00022600
         B     RTRNWARN            GO TO RC 204 CODE                    00022700
FRACFAIL MVC   SAFPRRET,=F'08'     FAIL ....                            00022800
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00022900
         B     RTRNFAIL            DO ANY EXCEPTIONS                    00023000
         TITLE 'RACDEF PROCESSING (NEW RESOURCE) '                      00023100
*---------------------------------------------------------------------* 00023200
*        RACDEF or RACROUTE REQUEST=DEFINE from the caller.             00023300
*---------------------------------------------------------------------* 00023400
RACDEF   L     R8,SAFPRACP         OFFSET TO RACDEF  PARAMETER LIST     00023500
         AR    R8,R9               ADDR. OF RACDEF PARAMETER LIST.      00023600
         USING RDDFLIST,R8                                              00023700
         XC    SAFPRRET,SAFPRRET   PRIME RC/REAS = 0                    00023800
         XC    SAFPRREA,SAFPRREA   PRIME RC/REAS = 0                    00023900
         TM    RDDFFLGS,RDDFTDEL+RDDFNEWN DELETE OR NEWNAME             00024000
         BZ    RACDNDEL            NOT DELETE                           00024100
         TM    RDDFFLG2,RDDFCHKA   CHECKAUTH SPEC.?                     00024200
         BZ    RACDGOOD            NO, RC=0                             00024300
*                                                                       00024400
RACDNDEL XR    ENTYREG,ENTYREG     CLEAR ENTYREG                        00024500
         XR    R2,R2               Clear R2 (to contain CLASS)     @rp2 00024600
         TM    RDDFFLGS,RDDF31IN   31 bit mode from RACROUTE?           00024700
         BO    RACDGCLS            Yes: take from 31 bit segment   @rp2 00024800
         ICM   ENTYREG,B'0111',RDDFENT Get entity name                  00024900
         ICM   R2,B'0111',RDDFCLNW CLASS ???                            00025000
         BNZ   RACDACEE            Yes: carry on                   @rp2 00025100
         LA    R2,RACDDSNC         Use our DATASET class           @rp2 00025200
         B     RACDACEE            Carry on                        @rp2 00025300
RACDGCLS ICM   ENTYREG,B'1111',RDDFEN31 Get entity from 31 bit     @rp2 00025400
         ICM   R2,B'0111',RDDFCLNW Get class                       @rp2 00025500
         BNZ   RACDACEE            We have the CLASS               @rp2 00025600
         LA    R2,RACDDSNC         Use our DATASET class           @rp2 00025700
RACDACEE MVC   WORKCLAS,=CL8' '    BLANK IT OUT                         00025800
         IC    R1,0(R2)            LENGTH                               00025900
         BCTR  R1,0                SUB 1 FOR MVC                        00026000
         EX    R1,RACDMVCC         MVC WORKCLAS(0),1(R2)                00026100
         CLC   WORKCLAS(8),=CL8' ' CLASS blank?                         00026200
         BNE   RACDNBLK               --> no, continue                  00026300
         MVC   WORKCLAS,=CL8'DATASET' --> yes, assume DATASET           00026400
RACDNBLK ICM   ACEEREG,B'1111',RDDFACEE POINT TO ACEE                   00026500
         BNZ   RACDCHCK            GO CHECK                             00026600
         L     R2,PSAAOLD          OUR ASCB                             00026700
         L     R2,ASCBASXB-ASCB(R2) OUR ASXB                            00026800
         ICM   ACEEREG,B'1111',ASXBSENV-ASXB(R2) ACEE                   00026900
         BZ    RACDGOOD            WHO KNOWS                            00027000
RACDCHCK MVI   WORKAUTH,RACFALTR   MOVE AUTH REQ.                       00027100
*                                                                       00027200
         TM    RDDFFLG2,RDDFRFI    RACFIND IND?                         00027300
         BZ    RACDCHK1            NO, DO ENTITY CHECK                  00027400
         OI    WORKFLAG,WORKNLOG   YES, SUPPRESS LOG                    00027500
*                                                                       00027600
RACDCHK1 BAL   R10,ENTYCHCK        GO DO ENTITY CHECK                   00027700
         B     RACDNEW             GOOD RETURN - CHECK RENAME           00027800
         B     RACDNEW             RC4 - UNKN                           00027900
         B     RACDFAIL            RC8 - FAIL                           00028000
RACDMVCC MVC   WORKCLAS(0),1(R2)   MOVE CLASS                           00028100
RACDDSNC DC    X'07',CL8'DATASET'  DATASET CLASS                        00028200
*                                                                       00028300
RACDNEW  TM    RDDFFLGS,RDDFNEWN   NEWNAME SPEC?                        00028400
         BNO   RACDCK18            CHECK 1.8 STUFF                      00028500
         L     ENTYREG,RDDFNNAM    LOAD NEWNAME                         00028600
         BAL   R10,ENTYCHCK        GO DO ENTITY CHECK                   00028700
         B     RACDCK18            CHECK 1.8 STUFF                      00028800
         B     RACDCK18            CHECK 1.8 STUFF                      00028900
         B     RACDFAIL            RC8 - FAIL                           00029000
*                                                                       00029100
RACDCK18 EQU   *                                                        00029200
*                                                                       00029300
RACDCMCL EQU   *                                                        00029400
         B     RACDGOOD            RC4 - UNKN                           00029500
*                                                                       00029600
RACDGOOD TM    WORKENTY,8          RC=8                                 00029700
         BO    RACDFAIL            BYPASS RC=4                          00029800
RACDNVFY TM    WORKENTY,4          RC=4                                 00029900
         BO    RACDUNKN            AT LEAST 1 WARN                      00030000
         TM    RDDFFLGS,RDDFCHGV   DELETE OR ADD                        00030100
         BNZ   RACDGDD0            GOOD 0                               00030200
         TM    RDDFFLG2,RDDFRFIY   RACFIND=YES                          00030300
         BO    RACDGDD0            --> Yes, RC=0                        00030400
         TM    RDDFFLG2,RDDFRFI    RACFIND=NO                           00030500
         BNO   RACDGDD0            --> No, RC=0                         00030600
         MVC   SAFPRREA,=F'04'     --> Yes, RC=0 & Reason=4             00030700
RACDGDD0 XC    SAFPRRET,SAFPRRET   NOTHING ...                          00030800
         B     RTRNGOOD            GO TO RC 200 CODE                    00030900
*                                                                       00031000
RACDUNKN MVC   SAFPRRET,=F'04'     NOT PROTECTED ...                    00031100
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00031200
         B     RTRNWARN            GO TO RC 204 CODE                    00031300
*                                                                       00031400
RACDFAIL MVC   SAFPRRET,=F'08'     FAIL ....                            00031500
         B     RTRNFAIL            DO ANY EXCEPTIONS                    00031600
         TITLE 'RACXTRT CODE - RETRIEVE DATA FROM PROFILE'              00031700
RACXTRT  L     R8,SAFPRACP         OFFSET TO RACXTRT PARAMETER LIST     00031800
         AR    R8,R9               ADDR. OF RACXTRT PARAMETER LIST.     00031900
         TM    3(R8),X'01'         EXTRACT ...                          00032000
         BO    RACXEXTR            GO ON                                00032100
         TM    3(R8),X'03'         EXTRACTN...                          00032200
         BO    RACXEXTR            GO ON                                00032300
         B     RACXUNKN            NOT YET SUPPORTED ...                00032400
*                                                                       00032500
RACXEXTR XR    R2,R2               CLEAR R2                             00032600
         LH    R2,6(R8)            GET OFFSET TO VARIABLE STUFF.        00032700
         AR    R2,R8               ADD BEGINNING OF RACXTRT             00032800
         ICM   R3,B'1111',0(R2)    GET CLASS ADDRESS                    00032900
         BZ    RACXUNKN            NONE ....                            00033000
         CLC   =C'USER',0(R3)      USER CLASS ????                      00033100
         BNE   RACXUNKN            NO, NOT SUPPORTED                    00033200
*                                                                       00033300
         ICM   R3,B'1111',8(R8)    GET ENTITY ADDRESS                   00033400
         BNZ   RACXENTY            GOT ENTITY(USERNAME)                 00033500
         ICM   ACEEREG,B'1111',X'14'(R2) ACEE REQ?                      00033600
         BNZ   RACXACEE            GO ON...                             00033700
         L     R3,PSAAOLD-PSA(0)   OUR ASCB                             00033800
         L     R3,ASCBASXB-ASCB(R3) OUR ASXB                            00033900
         ICM   ACEEREG,B'1111',ASXBSENV-ASXB(R3) ACEE                   00034000
         BZ    RACXUNKN            WHO KNOWS                            00034100
RACXACEE LA    R3,ACEEUSRI         GET ACEEUSER                         00034200
RACXENTY ICM   R8,B'1111',X'0C'(R2) CHECK SEGMENT                       00034300
         BZ    RACXUNKN            BASE NOT SUPPORTED                   00034400
         CLC   =C'TSO',0(R8)       TSO SEGMENT?                         00034500
         BNE   RACXUNKN            NO, NOT SUPPORTED                    00034600
         B     RACXUNKN            GO THERE ANYWAY                      00034700
*        FIELDS ...                                                     00034800
*  GETMAIN AREA IN SP... & RETURN IN ...                                00034900
*                                                                       00035000
RACXUNKN MVC   SAFPRRET,=F'08'     NOT PROTECTED ...                    00035100
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00035200
         B     RTRNWARN            GO TO RC 208 CODE                    00035300
*                                                                       00035400
         TITLE 'RACINIT PROCESS. (GET INTO/OUT OF SYSTEM) - CHECK AUTH' 00035500
*---------------------------------------------------------------------* 00035600
*        RACINIT or RACROUTE REQUEST=VERIFY from the caller.            00035700
*---------------------------------------------------------------------* 00035800
RACINIT  L     R8,SAFPRACP         OFFSET TO RACINIT PARAMETER LIST     00035900
         AR    R8,R9               ADDR. OF RACINIT PARAMETER LIST.     00036000
         TM    3(R8),X'C0'         TEST FOR VERIFY                      00036100
         BO    RTRN0000            ENVIR=VERIFY USED BY JES2 EARLY VFY  00036200
*                                                                       00036300
         L     R2,PSATOLD          ADDRESS TCB                          00036400
         L     R2,TCBRBP-TCB(R2)   ADDRESS RB                           00036500
         TM    RBSTAB1-RBSECT(R2),RBFTP CHECK RBTYPE                    00036600
         BZ    RACIRACR            PRB DID RACROUTE                     00036700
*                                                                       00036800
         XR    R3,R3               CLEAR R3                             00036900
         ICM   R3,B'0111',RBLINKB-RBSECT(R2) PRIOR RB                   00037000
         S     R3,=A(RBSECT-RBPREFIX) SUBTRACT PFIX LENG                00037100
         CLI   RBINTCOD-RBPREFIX+1(R3),X'83' SVC 131 (RACINIT SVC)      00037200
         BNE   RACIRACR            SVC ISSUED RACROUTE                  00037300
*                                                                       00037400
         ICM   R2,B'0111',RBLINKB-RBSECT(R2) PRIOR RB                   00037500
         TM    RBSTAB1-RBSECT(R2),RBFTP PRB?????                        00037600
         BNZ   RACINAUT            NO, DON'T BOTHER WITH TABLE          00037700
*                                                                       00037800
         ICM   R2,B'0111',RBCDE1-RBSECT(R2) PRIOR RB                    00037900
         BZ    RACINAUT            NO CDE                               00038000
         L     R3,FLCCVT           LOAD CVT                             00038100
         ICM   R3,B'1111',CVTRAC-CVTMAP(R3) CHECK RCVT                  00038200
         BZ    RACIERR1            WHO KNOWS                            00038300
         ICM   R3,B'1111',RCVTAUTP-RCVT(R3) CHECK AUTHORIZED CALLERS    00038400
         BZ    RACINAUT            NO TABLE                             00038500
*                                                                       00038600
RACIAUTL CLC   =F'0',0(R3)         END OF TABLE?                        00038700
         BE    RACINAUT            YES, SORRY                           00038800
         CLC   CDNAME-CDENTRY(,R2),0(R3) IS THIS US?                    00038900
         BE    RACIMDST            YES, BYPASS TESTAUTH                 00039000
         LA    R3,12(,R3)          NEXT ENTRY                           00039100
         B     RACIAUTL            GO ON                           @rp1 00039200
*                                                                       00039300
RACINAUT TESTAUTH FCTN=1,STATE=YES,KEY=YES    APF/SUP/KEY0-7            00039400
         LTR   R15,R15             GOT IT?                              00039500
         BZ    RACIMDST            YES, GO ON                           00039600
         ABEND 1667,,,SYSTEM       Abend S683                           00039700
*                                                                       00039800
RACIRACR TESTAUTH FCTN=1,STATE=YES,KEY=YES,RBLEVEL=1 APF/SUP/KEY0-7     00039900
         LTR   R15,R15             GOT IT?                              00040000
         BZ    RACISCHP            YES, GO ON                           00040100
         ABEND 1667,,,SYSTEM       Abend S683                           00040200
*                                                                       00040300
RACISCHP TESTAUTH STATE=YES,RBLEVEL=1 SUPV STATE?                       00040400
         LTR   R15,R15             GOT IT?                              00040500
         BZ    RACIMDST            YES, GO ON                           00040600
         OI    WORKFLAG,WORKSUPO   SUP. ON                              00040700
         MODESET MODE=SUP          SET STATE                            00040800
*                                                                       00040900
RACIMDST MODESET EXTKEY=ZERO,SAVEKEY=WORKKEY,WORKREG=2                  00041000
         TITLE 'RACINIT PROCESS. (GET INTO/OUT OF SYSTEM) '             00041100
         TM    3(R8),X'40'         ENVIR=CHANGE?                   @rp2 00041200
         BO    RACIGOOD            NOT YET SUPPORTED ...                00041300
         TM    3(R8),X'80'         ENVIR=DELETE?                   @rp2 00041400
         BO    RACINDEL            NO, GO DELETE ACEE                   00041500
*                                                                       00041600
         ICM   R5,B'1111',4(R8)    UserID from RACINIT parmlist    @rp2 00041700
         BZ    RACINOID            NONE, CHECK FOR STC ...              00041800
         L     R4,FLCCVT           LOAD CVT                             00041900
         ICM   R4,B'1111',CVTRAC-CVTMAP(R4) CHECK RCVT                  00042000
         BZ    RACIERR1            Error: No RCVT                  @rp2 00042100
*---------------------------------------------------------------------* 00042200
*        CJYRCVT contains 2 pointers. 1 = address of users table      * 00042300
*                                     2 = address of profiles table   * 00042400
*---------------------------------------------------------------------* 00042500
         ICM   R4,B'1111',RCVTISTL-RCVT(R4) CJYRCVTD present?      @rp2 00042600
         BZ    RACIERR1            WHO KNOWS                            00042700
         ICM   R4,B'1111',CJYUSERS-CJYRCVTD(R4) Point to user table@rp2 00042800
         BZ    RACIERR1            Not there: error                     00042900
         USING CBLK,R4             Base CJYUCBLK                        00043000
RACICKLP IC    R1,CBLKUSRL         Length of UserID                     00043100
         EX    R1,RACINCLC         CLC CBLKUSER(0),0(R5)                00043200
         BE    RACIIDOK            ID OK                                00043300
         ICM   R4,B'1111',CBLKNEXT GO TO NEXT ID                        00043400
         BNZ   RACICKLP            GO FOR NEXT                          00043500
*RACICSTC removed - STC/PROD explicit login no longer permitted         00043600
         B     RACIREVK            Not in Users table - reject          00043700
RACINCLC CLC   CBLKUSER(0),0(R5)   CORE UID VS RACINIT << executed >>   00043800
*                                                                       00043900
RACIIDOK TM    3(R8),X'08'         PASSCHK=NO in RACINIT parmlist? @rp2 00044000
         BO    RACIACEE            Yes: go make ACEE                    00044100
         ICM   R3,B'1111',8(R8)    Pickup password address              00044200
         BZ    RACIINPW            No password -> invalid               00044300
         MVC   WORKPASS,0(R3)      MOVE PASSWORD (LEN + UP TO 8 CHARS)  00044400
*---------------------------------------------------------------------* 00044500
*        Hash SALT||candidate via RAKFPWH and compare to stored hash  * 00044600
*---------------------------------------------------------------------* 00044700
         GETMAIN RU,LV=HASHWKL     Work area for hashing (key 0 here)   00044800
         LR    R2,R1               R2 -> gotten area                    00044900
         USING HASHWKD,R2                                               00045000
         ST    R13,HWR13           Save caller save-area pointer        00045100
         LA    R0,CBLKSALT         A(salt) - CBLK based on R4           00045200
         ST    R0,HWPL+0                                                00045300
         LA    R0,WORKPASS+1       A(candidate password chars)          00045400
         ST    R0,HWPL+4                                                00045500
         SR    R0,R0                                                    00045600
         IC    R0,WORKPASS         Candidate password length            00045700
         ST    R0,HWPWLEN                                               00045800
         LA    R0,HWPWLEN                                               00045900
         ST    R0,HWPL+8           A(PASSWORD length)                   00046000
         LA    R0,HWOUT                                                 00046100
         ST    R0,HWPL+12          A(output hash)                       00046200
         LA    R0,HWWORK                                                00046300
         ST    R0,HWPL+16          A(RAKFPWH work area)                 00046400
         LA    R1,HWPL             R1 -> parameter list                 00046500
         LA    R13,HWSAVE          Save area for the call               00046600
         L     R15,=V(RAKFPWH)                                          00046700
         BALR  R14,R15             Compute SHA-256(salt||password)      00046800
         L     R13,HWR13           Restore caller save-area pointer     00046900
         CLC   CBLKHASH,HWOUT      Stored Hash vs computed Hash         00047000
         BNE   RACIPWNO            mismatch                             00047100
         LA    R3,1                Passwords do match                   00047200
         B     RACIPWFR                                                 00047300
RACIPWNO LA    R3,0                Passwords dont match                 00047400
RACIPWFR LR    R1,R2               Area to free                         00047500
         DROP  R2                                                       00047600
         FREEMAIN RU,LV=HASHWKL,A=(R1)  Release work area               00047700
         LTR   R3,R3               Matched?                             00047800
         BNZ   RACIPWOK            Yes, password is correct             00047900
         B     RACIINPW            No, invalid password                 00048000
RACIPWOK EQU   *                                                        00048100
RACICHPW EQU   *                                                        00048200
RACINCL2 EQU   *                                                        00048300
*                                                                       00048400
         ICM   R3,15,24(R8)        Set new password in RACINIT PLIST?   00048500
         BZ    RACIACEE            No: go make ACEE                     00048600
         MVC   WORKPASS,0(R3)      Yes, move new password               00048700
         GETMAIN RU,LV=PWUPL,SP=227 Get fetch protected CSA         @02 00048800
         MVC   0(PWUPCMDL,R1),PWUPSTRT move SVC 34 plist to CSA area@02 00048900
         L     R3,PWUPXTBA         Get translate table address      @02 00049000
         USING PWUPSTRT,R1         Address CSA area now             @02 00049100
         ST    R1,PWUPADDR         Store CSA area address for unpack@02 00049200
         UNPK  PWUPUNPK(9),PWUPADDR(5) unpack CSA area address      @02 00049300
         MVC   PWUPAHEX(8),PWUPUNPK unpacked address to SVC 34 plist@02 00049400
         TR    PWUPAHEX(8),0(R3)   Translate address to printable   @02 00049500
         DROP  R1                  Revert to standard addressability@02 00049600
         MVC   PWUPCMDL(PWUPRECL,R1),PWUP initialize change record  @02 00049700
         IC    R3,0(,R5)           Length of user                   @02 00049800
         BCTR  R3,0                Subtract 1 for MVC               @02 00049900
         EX    R3,PWUPMVCU         Copy user                        @02 00050000
         IC    R3,WORKPASS         Length of new password           @02 00050100
         BCTR  R3,0                Subtract 1 for MVC               @02 00050200
         EX    R3,PWUPMVCP         Copy new password                @02 00050300
         XR    R0,R0               Set R0 = 0 for SVC 34            @02 00050400
         SVC   34                  S RAKFPWUP,PARM='PWUPAHEX'       @02 00050500
         XC    WORKPASS+1(8),=C'SECURITY' encrypt                       00050600
         IC    R1,WORKPASS         Length of new password               00050700
         EX    R1,RACIRPWD         Replace password                     00050800
         B     RACIACEE            Go make ACEE                         00050900
PWUPSTRT DC    AL2(PWUPCMDL)       Parameter list to start RAKFPWUP>@02 00051000
         DC    X'0000'              >is copied to CSA subpool 227  >@02 00051100
         DC    C'S RAKFPWUP,PARM=''' >fetch protected storage with >@02 00051200
PWUPAHEX DS    CL8                 >address passed in PARM field  > @02 00051300
         DC    C''''               >in hexadecimal printable format @02 00051400
PWUPCMDL EQU   *-PWUPSTRT          Length of parameter list         @02 00051500
PWUP     DS    0C                  Changes queue record             @02 00051600
PWUPUSER DC    CL8' '              UserID                           @02 00051700
         DC    C' '                Filler                           @02 00051800
PWUPPSWD DC    CL8' '              New password                     @02 00051900
         DC    C' '                Filler                           @02 00052000
PWUPRECL EQU   *-PWUP              Record length of changes queue   @02 00052100
PWUPL    EQU   *-PWUPSTRT          Total length of CSA area         @02 00052200
         ORG   PWUP                Changes queue record is >        @02 00052300
PWUPADDR DS    F                      > temporarily used   >        @02 00052400
         DS    X                      > for conversion of  >        @02 00052500
PWUPUNPK DS    CL8                    > CSA area to        >        @02 00052600
         DS    X                      > unpacked format             @02 00052700
         ORG   PWUP+PWUPRECL       Restore program counter          @02 00052800
         USING PWUPSTRT,R1         Address CSA area now             @02 00052900
PWUPMVCU MVC   PWUPUSER(1),1(R5)   Get user and new password >      @02 00053000
PWUPMVCP MVC   PWUPPSWD(1),WORKPASS+1  > into change queue record   @02 00053100
         DROP  R1                  Revert to standard addressability@02 00053200
PWUPHXTB DC    C'0123456789ABCDEF' translate RAKFPWUP address to >  @02 00053300
PWUPXTBA DC    A(PWUPHXTB-240)      > hex printable format          @02 00053400
RACIRPWD MVC   CBLKPWDL(1),WORKPASS replace in core password            00053500
RACICKPW CLC   CBLKPWDL(1),WORKPASS check password                      00053600
*RACISTPW removed - no longer referenced                                00053700
RACIERR1 MVC   WORKWTO+4(60),WTOMSG1 CJYUSERS INVALID                   00053800
         WTO   MF=(E,WORKWTO)      WRITE IT                             00053900
         MVC   WORKWTO+4(60),WTOMSG2 STC ACCESS                         00054000
         ICM   R5,B'1111',4(R8)    GO TO USERID                         00054100
         IC    R1,0(R5)            GET LENGTH                           00054200
         EX    R1,RACIWTO1         MOVE NAME FOR WTO                    00054300
         WTO   MF=(E,WORKWTO)      WRITE IT                             00054400
         B     RACISSTC            ASSUME STC                           00054500
RACIWTO1 MVC   WORKWTO+5+WTOMSG2U(0),1(R5) MOVE USERID                  00054600
*                                                                       00054700
RACINOID CLC   =F'0',X'C'(R8)      STC ?                                00054800
         BNE   RACISSTC            YES, DO IT ...                       00054900
         CLC   =F'0',X'28'(R8)     TERMID specified in RACINIT parmlist 00055000
         BNE   RACIREVK            TSO ---- > REVOKED                   00055100
         CLC   =F'0',X'2C'(R8)     JOBNAME SPEC.?                       00055200
         BNE   RACISBAT            BATCH, OK ....                       00055300
         ICM   R2,B'1111',PSAAOLD   POINT TO ASCB OLD                   00055400
         BZ    RACISSTC            ASSUME STC                           00055500
         CLC   =F'0',ASCBJBNI-ASCB(R2) JOBNAME SPEC.?                   00055600
         BNE   RACISBAT            BATCH, OK ....                       00055700
RACISSTC LA    R4,STCUID-L'CBLKNEXT POINT TO UID                        00055800
         BAL   R10,WTOSTC          REPORT STC DEFAULT USAGE             00055900
         B     RACIACEE            GO BUILD ACEE                        00056000
RACISBAT LA    R4,PRODUID-L'CBLKNEXT POINT TO UID                       00056100
         BAL   R10,WTOPROD         REPORT PROD DEFAULT USAGE            00056200
         B     RACIACEE            GO BUILD ACEE                        00056300
         TITLE 'RACINIT PROCESS. (GET INTO/OUT OF SYSTEM) - BUILD ACEE' 00056400
*---------------------------------------------------------------------* 00056500
*        Build the Accesor Environment Element (ACEE)                 * 00056600
*---------------------------------------------------------------------* 00056700
RACIACEE LA    R2,255              PRE-FILL WITH LSQA SUBPOOL           00056800
         TM    3(R8),X'10'         Subpool specified?              @rp2 00056900
         BNO   RACINDGM            DO GETMAIN                           00057000
         IC    R2,1(R8)            Subpool number from RACINIT     @rp2 00057100
RACINDGM GETMAIN RC,LV=ACEEL,SP=(R2) DO GETMAIN                         00057200
         LR    ACEEREG,R1          ADDRESS AREA                         00057300
         XC    ACEE(ACEEL),ACEE    CLEAR IT                             00057400
         MVC   ACEEACEE,=C'ACEE'   ACEE NAME                            00057500
         STC   R2,ACEESP           Subpool to GETRAIN              @rp2 00057600
         MVC   ACEEAPLN,=CL8' '    Application name                @rp2 00057700
         ICM   R2,B'1111',48(R8)   APPL specified in RACINIT?      @rp2 00057800
         BZ    *+10                No: leave blank                 @rp2 00057900
         MVC   ACEEAPLN,0(R2)      Move APPL name                  @rp2 00058000
         MVC   ACEELEN,=AL3(ACEEL) LENGTH                               00058100
         MVI   ACEEVRSN,C'1'       VERSION 1                            00058200
         MVC   ACEEUSER,CBLKUSER   UserID (Length + User)          @rp2 00058300
         MVC   ACEEGRP,CBLKGRP     Default GROUP (Length + group)  @rp2 00058400
         OI    ACEEFLG1,ACEERACF+ACEECNTL                               00058500
         OI    ACEEFLG2,ACEENONE   Default UACC = NONE             @rp2 00058600
         L     R2,FLCCVT           CVT                                  00058700
         MVC   ACEEDATE,CVTDATE+1-CVT(R2) MOVE DATE                     00058800
         CLI   CBLKFLG1,C'Y'       Operations authority?           @rp2 00058900
         BNE   RACINNOP            No: do not set flag                  00059000
         OI    ACEEFLG1,ACEEOPER   Set OPERATIONS authority        @rp2 00059100
RACINNOP CLI   CBLKSPEC,C'Y'       SPECIAL authority?              @rp2 00059200
         BNE   RACIPROC            No: do not set flag             @rp2 00059300
         OI    ACEEFLG1,ACEESPEC   Set SPECIAL authority           @rp2 00059400
RACIPROC MVC   ACEEPROC,=CL8' '    Blank STC procedure name        @rp2 00059500
         ICM   R2,B'1111',12(R8)   STC ?                                00059600
         BZ    RACINANS            NO, BATCH                            00059700
         MVC   ACEEPROC,0(R2)      MOVE PROC NAME FOR STC               00059800
RACINANS ICM   R2,B'1111',40(R8)   TERMID specified?               @rp2 00059900
         BZ    RACINNTR            No: not specified               @rp2 00060000
         MVC   ACEETRID,0(R2)      Move Terminal ID                @rp2 00060100
RACINNTR CLM   ACEEREG,B'1000',=X'00' ABOVE THE LINE?                   00060200
         BE    RACICGRP            NO, ADD GROUPS                       00060300
*                                                                       00060400
RACICGRP ICM   R3,B'1111',CBLKGRPS Pointer to connected groups     @rp2 00060500
         BNZ   RACICGP1            NONE IN PROFS                        00060600
         LA    R3,STCGROUP         STC GROUP IF STC                     00060700
         CLC   =CL8'STC',ACEEUSRI  STC?                                 00060800
         BE    RACICGP1            YES, GO ON                           00060900
         LA    R3,PRDGROUP         NO USE PRD GROUP                     00061000
RACICGP1 LA    R5,ACEECGRP         FIRST POINTER                        00061100
         XR    R2,R2               CLEAR R2                             00061200
         IC    R2,ACEESP           GET SUBPOOL                          00061300
RACICGPL GETMAIN RC,LV=CONNL,SP=(R2)                                    00061400
         XC    0(CONNL,R1),0(R1)   CLEAR AREA                           00061500
         ST    R1,0(R5)            SAVE IN PTR                          00061600
         MVC   CONNGRP-CONNGRUP(,R1),CONNGRP-CONNGRUP(R3) THEM TO US    00061700
         LA    R5,CONNNEXT-CONNGRUP(R1) NEXT POINTER                    00061800
         ICM   R3,B'1111',CONNNEXT-CONNGRUP(R3) NEXT CONN.              00061900
         BNZ   RACICGPL            NEXT CGRP.                           00062000
*                                                                       00062100
         CLI   0(R8),X'34'         check length of RACINIT plist        00062200
         BNL   RACIAPPL            -> ge x'34' continue                 00062300
         B     RACINSTA            -> lt x'34' store ACEE addr in ASXB  00062400
RACIAPPL ICM   ENTYREG,B'1111',X'30'(R8) ANY APPL REQ?                  00062500
         BZ    RACITERM            NO, GO ON                            00062600
         MVC   WORKCLAS,=CL8'APPL' APPL CLASS                           00062700
         MVI   WORKAUTH,RACFREAD   READ REQ                             00062800
         BAL   R10,ENTYCHCK        CHECK ENTITY                         00062900
         B     RACITERM            0 -> OK                              00063000
         B     RACITERM            4 -> OK                              00063100
         B     RACIFAPL            8 -> NG                              00063200
*                                                                       00063300
RACITERM ICM   ENTYREG,B'1111',X'28'(R8) ANY APPL REQ?                  00063400
         BZ    RACIALOK            NO, GO ON                            00063500
         MVC   WORKCLAS,=CL8'TERMINAL' TERM CLASS                       00063600
         MVI   WORKAUTH,RACFREAD   READ REQ                             00063700
         BAL   R10,ENTYCHCK        CHECK ENTITY                         00063800
         B     RACIALOK            0 -> OK                              00063900
         B     RACIALOK            4 -> OK                              00064000
         B     RACIFTRM            8 -> NG                              00064100
*                                                                       00064200
RACIALOK ICM   R2,B'1111',X'34'(R8) ACEE PTR                            00064300
         BZ    RACINSTA            SAVE ACEE                            00064400
         ST    ACEEREG,0(R2)       SAVE ACEE ADDRESS                    00064500
         B     RACIGOOD            OK ..........                        00064600
RACINSTA EQU   *                                                        00064700
         L     R2,PSAAOLD          ADDRESS ASCB                         00064800
         L     R2,ASCBASXB-ASCB(R2) ADDRESS ASCB                        00064900
         ST    ACEEREG,ASXBSENV-ASXB(R2) STORE IN ASXB                  00065000
         B     RACIGOOD            OK ..........                        00065100
*                                                                       00065200
         DROP  R4                                                       00065300
         TITLE 'RACINIT PROCESS. (GET INTO/OUT OF SYSTEM) - DEL. ACEE'  00065400
*---------------------------------------------------------------------* 00065500
*        RACINIT or RACROUTE REQUEST=VERIFY,ENVIR=DELETE                00065600
*---------------------------------------------------------------------* 00065700
RACINDEL ICM   R2,B'1111',X'34'(R8) ACEE PTR                            00065800
         BZ    RACIDNAC            DELETE, NO ACEE                      00065900
         L     ACEEREG,0(R2)       GET ACEE ADDRESS                     00066000
         B     RACINFRE            GO DO FREEMAIN                       00066100
RACIDNAC EQU   *                                                        00066200
         L     R2,PSAAOLD          OUR ASCB                             00066300
         L     R2,ASCBASXB-ASCB(R2) OUR ASXB                            00066400
         C     ACEEREG,ASXBSENV-ASXB(R2) ACEE SAME?                     00066500
         BNE   RACINTDM            NO, GO DO FREE                       00066600
         XC    ASXBSENV-ASXB(,R2),ASXBSENV-ASXB(R2) YES, CLEAR          00066700
         B     RACINFRE            GO FREE ACEE                         00066800
*                                                                       00066900
RACINTDM L     R2,PSAAOLD          OUR ASCB                             00067000
         L     R2,ASCBASXB-ASCB(R2) OUR ASXB                            00067100
         ICM   ACEEREG,B'1111',ASXBSENV-ASXB(R2) ACEE                   00067200
         BZ    RACIGOOD            ASXB & TCB  BOTH DUMMY               00067300
         XC    ASXBSENV-ASXB(,R2),ASXBSENV-ASXB(R2) CLEAR ASXB          00067400
RACINFRE ICM   R2,B'1111',ACEEIEP  ANY OTHER F.M?                       00067500
         BZ    RACINIEP            NO, SO BYE...                        00067600
         XR    R3,R3               CLEAR R3                             00067700
         IC    R3,0(R2)            SUBPOOL                              00067800
         XR    R4,R4               CLEAR R4                             00067900
         ICM   R4,B'0111',1(R2)    LENGTH                               00068000
         FREEMAIN RC,A=(R2),SP=(R3),LV=(R4) FREE ????                   00068100
*                                                                       00068200
RACINIEP XR    R2,R2               CLEAR R2                             00068300
         IC    R2,ACEESP           SUBPOOL                              00068400
         LA    R3,CONNL            CLEAR R3                             00068500
         L     R5,ACEECGRP         CONN. GROUPS                         00068600
         B     RACIFCN2            START FREEMAINS                      00068700
RACIFCNL L     R5,CONNNEXT-CONNGRUP(R4) LOOP THRU OLD TABLE             00068800
         FREEMAIN RC,A=(R4),SP=(R2),LV=(R3) FREE ACEE                   00068900
RACIFCN2 LTR   R4,R5               MORE ENTRIES?                        00069000
         BNZ   RACIFCNL             Y - NEXT ENTRY                      00069100
*                                                                       00069200
RACINCGP XR    R2,R2               CLEAR R2                             00069300
         IC    R2,ACEESP           SUBPOOL                              00069400
         XR    R3,R3               CLEAR R3                             00069500
         ICM   R3,B'0111',ACEELEN  LENGTH                               00069600
         FREEMAIN RC,A=(ACEEREG),SP=(R2),LV=(R3) FREE ACEE              00069700
         B     RACIGOOD            GO TO GOOD RETURN CODE               00069800
         TITLE 'RACINIT PROCESS. (GET INTO/OUT OF SYSTEM) - Bye'        00069900
RACIGOOD XC    SAFPRRET,SAFPRRET   NOTHING ...                          00070000
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00070100
         XC    WORKPASS,WORKPASS   CLEAR JUST IN CASE                   00070200
         MODESET KEYADDR=WORKKEY,WORKREG=2                              00070300
         TM    WORKFLAG,WORKSUPO   SUP. ON                              00070400
         BNO   RTRNGOOD            NO, GO TO RC 200 CODE                00070500
         MODESET MODE=PROB         SET STATE                            00070600
         B     RTRNGOOD            GO TO RC 200 CODE                    00070700
*                                                                       00070800
RACIUNKN MVC   SAFPRRET,=F'04'     NOT PROTECTED ...                    00070900
         MODESET KEYADDR=WORKKEY,WORKREG=2                              00071000
         TM    WORKFLAG,WORKSUPO   SUP. ON                              00071100
         BNO   RTRNWARN            NO, GO TO RC 204 CODE                00071200
         MODESET MODE=PROB         SET STATE                            00071300
         B     RTRNWARN            GO TO RC 204 CODE                    00071400
*                                                                       00071500
RACIINPW MVC   SAFPRRET,=F'08'     Invalid or no password entered       00071600
         XC    WORKPASS,WORKPASS   Clear just in case                   00071700
         B     RACIFAIL            BRANCH TO FAIL COMMON                00071800
*                                                                       00071900
RACIREVK MVC   SAFPRRET,=F'28'     REVOKED....                          00072000
         B     RACIFAIL            BRANCH TO FAIL COMMON                00072100
*                                                                       00072200
RACIFAPL MVC   SAFPRRET,=F'52'     NOT AUTH TO APPL...                  00072300
         B     RACIFAFM            FAIL & FREEMAIN                      00072400
RACIFTRM MVC   SAFPRRET,=F'48'     NOT AUTH TO TERM...                  00072500
*                                                                       00072600
RACIFAFM ICM   R4,B'1111',ACEECGRP CONN. GROUPS                         00072700
         BZ    RACIFACF            NO: GO FREEMAIN ACEE                 00072800
         XR    R2,R2               CLEAR R2                             00072900
         IC    R2,ACEESP           SUBPOOL                              00073000
         LA    R3,CONNL            CLEAR R3                             00073100
         B     RACIFAG2            BYPASS MOVE                          00073200
RACIFAGL L     R5,CONNNEXT-CONNGRUP(R4) LOOP THRU OLD TABLE             00073300
         FREEMAIN RC,A=(R4),SP=(R2),LV=(R3) FREE ACEE                   00073400
RACIFAG2 LTR   R4,R5               MORE ENTRIES?                        00073500
         BNZ   RACIFAGL             Y - NEXT ENTRY                      00073600
*                                                                       00073700
RACIFACF XR    R2,R2               CLEAR R2                             00073800
         IC    R2,ACEESP           SUBPOOL                              00073900
         XR    R3,R3               CLEAR R3                             00074000
         ICM   R3,B'0111',ACEELEN  LENGTH                               00074100
         FREEMAIN RC,A=(ACEEREG),SP=(R2),LV=(R3) FREE ACEE              00074200
         B     RACIFAIL            BRANCH TO FAIL COMMON                00074300
*                                                                       00074400
RACIFAIL MODESET KEYADDR=WORKKEY,WORKREG=2                              00074500
         TM    WORKFLAG,WORKSUPO   SUP. ON                              00074600
         BNO   RACINPWF            No  --> check for WTO suppression    00074700
         MODESET MODE=PROB         SET STATE                            00074800
RACINPWF CLC   SAFPRRET,=F'08'     Invalid or no password entered?      00074900
         BNE   RACIFWTO            No  --> write message                00075000
         LTR   R3,R3               yes --> no password entered?         00075100
         BZ    RTRNFAIL            yes --> don't write message          00075200
RACIFWTO MVC   WORKWTO+4(60),WTOMSG4  ATTEMPTED ACCESS                  00075300
         ICM   R5,B'1111',4(R8)    GO TO USERID                         00075400
         IC    R1,0(R5)            GET LENGTH                           00075500
         EX    R1,RACIWTO2         MOVE NAME FOR WTO                    00075600
         WTO   MF=(E,WORKWTO)      WRITE IT                             00075700
         XC    SAFPRREA,SAFPRREA   NOTHING ...                          00075800
         XC    WORKPASS,WORKPASS   CLEAR JUST IN CASE                   00075900
         B     RTRNFAIL            BYE ............                     00076000
RACIWTO2 MVC   WORKWTO+4+WTOMSG4U(0),1(R5) MOVE USERID                  00076100
         TITLE 'ALL ROADS LEAD HERE'                                    00076200
RTRN0000 LA    R15,0               RC = 0                               00076300
         B     RTRNRTRN            GO BACK                              00076400
*                                                                       00076500
RTRNGOOD LA    R15,0               RACF RC=0                            00076600
         B     RTRNRTRN            GO BACK                              00076700
*                                                                       00076800
RTRNWARN LA    R15,4               RACF RC=4                       @rp2 00076900
         B     RTRNRTRN            GO BACK                              00077000
*                                                                       00077100
RTRNFAIL LA    R15,8               RACF RC=8                       @rp2 00077200
         B     RTRNRTRN            GO BACK                              00077300
*                                                                       00077400
RTRNRTRN L     R13,WORKSAVE+4      RETURN R13                           00077500
         RETURN (14,12),RC=(15)    BYE                                  00077600
*                                                                       00077700
         TITLE 'CHECK FOR ACCESS'                                       00077800
ENTYCHCK MVI   WORKENTL,0          Nullify Entity length           @rp2 00077900
         L     R2,FLCCVT           LOAD CVT                             00078000
         ICM   R2,B'1111',CVTRAC-CVTMAP(R2) CHECK RCVT                  00078100
         BZ    ENTYERR1            WHO KNOWS?                           00078200
         ICM   R2,B'1111',RCVTISTL-RCVT(R2) OUR STUFF?                  00078300
         BZ    ENTYERR1            WHO KNOWS?                           00078400
         ICM   R2,B'1111',CJYPROFS-CJYRCVTD(R2) OUR STUFF?              00078500
         BZ    ENTYERR1            WHO KNOWS?                           00078600
         USING RPECBLK,R2          ADDRESS CBLK                         00078700
         CLC   WORKCLAS(8),=CL8' '    CLASS blank?                      00078800
         BNE   ENTYNBLK                  --> no, continue               00078900
         MVC   WORKCLAS(8),=CL8'DATASET' --> yes, assume DATASET        00079000
ENTYNBLK CLC   =C'DATASET',WORKCLAS  CHECK FOR OUR OWN DSNS.            00079100
         BNE   ENTYCLLP            NO, GO ON                            00079200
         XR    R1,R1               Clear is needed for LA          @mg1 00079300
         IC    R1,ACEEUSRL         GET LENGTH                           00079400
         BCTR  R1,0                DOWN 1 FOR CLC                       00079500
         EX    R1,ENTYEXUS         CLC 0(0,ENTYREG),ACEEUSRN            00079600
         BNE   ENTYTEMP            No: not our dataset             @mg1 00079700
         LA    R14,1(R1,ENTYREG)   Point after UserID              @mg1 00079800
         CLI   0(R14),C'.'         First qualifier is UserID?      @mg1 00079900
         BE    AUTHGOOD            Yes: definitely our dataset     @mg1 00080000
ENTYTEMP DS    0H                                                  @mg1 00080100
         CLC   0(3,ENTYREG),=C'SYS' is it a ..                          00080200
         BNE   ENTYCLLP              --> no                             00080300
         CLC   8(2,ENTYREG),=C'.T'            .. temporary ..           00080400
         BNE   ENTYCLLP              --> no                             00080500
         CLC   16(3,ENTYREG),=C'.RA'                         .. dataset 00080600
         BNE   ENTYCLLP              --> no, go on                      00080700
         B     AUTHGOOD              --> yes, go for it                 00080800
ENTYCLLP XC    WORKSTAT,WORKSTAT   Parameter for RACSTAT           @rp2 00080900
         LA    R1,WORKCLAS         Class name                      @rp2 00081000
         ST    R1,WORKSTAT         Class name to check             @rp2 00081100
         LA    R1,WORKSTAT         Parameter for RACSTAT           @rp2 00081200
         L     R3,X'4C'            Pointer CVT                     @rp2 00081300
         ICM   R3,B'1111',CVTRAC-CVTMAP(R3) Load RCVT              @rp2 00081400
         ICM   R15,15,RCVTREXP-RCVT(R3)  Entry point RACSTAT       @rp2 00081500
         BZ    ENTYCLL2            Give it the benefit of the doubt@rp2 00081600
         BALR  R14,R15             Invoke RACSTAT (in CJYRCVT)     @rp2 00081700
         LTR   R15,R15             Is CLASS present in CDT?        @rp2 00081800
         BZ    ENTYCLL2            Yes: continue                   @rp2 00081900
         LR    R5,R10              Save entry register             @rp2 00082000
         BAL   R10,WTOUNKN         Msg: Undefined Class xxxxxxxx   @rp2 00082100
         LR    R10,R5              Restore entry register          @rp2 00082200
         B     AUTHFAIL            RC=8 --> exit                   @rp2 00082300
ENTYCLL2 IC    R1,RPECLASL         Get length from Profile entry   @rp2 00082400
         BCTR  R1,0                SUBTRACT 1 FOR CLC                   00082500
         EX    R1,ENTYEXEC         CLC RPECLASN(0),WORKCLAS             00082600
         BL    ENTYNFND            NOT FOUND                            00082700
         BNE   ENTYNCLS            NO, GET NEXT                         00082800
         MVC   WORKENTL,RPEENTYL   Copy Entity length field        @rp2 00082900
         ICM   R1,B'0001',RPEENTYL GET LENGTH                           00083000
         BZ    ENTYENFN            '*' ONLY ENTITY?                     00083100
         BCTR  R1,0                NO, SUBTRACT 1 FOR CLC               00083200
         EX    R1,ENTYEXEN         CLC RPEENTYN(0),0(ENTYREG)           00083300
         BE    ENTYENFN            FOUND ENTITY                         00083400
ENTYNCLS ICM   R2,B'1111',RPENEXT  GET NEXT                             00083500
         BNZ   ENTYCLLP            GO FOR NEXT                          00083600
ENTYNFND B     ENTYWARN            RETURN WARN                          00083700
ENTYEXEC CLC   RPECLASN(0),WORKCLAS SAME CLASS? << executed >>          00083800
ENTYEXEN CLC   RPEENTYN(0),0(ENTYREG) CHECK ENTITY                      00083900
ENTYEXUS CLC   0(0,ENTYREG),ACEEUSRI US?                                00084000
*                                                                       00084100
ENTYENFN ICM   R3,B'1111',RPEACCPT POINTER TO ACCESSES                  00084200
         BZ    ENTYUACC            GO CHECK UACC                        00084300
*                                                                       00084400
         USING RPEACCLE,R3         VARIABLE SECTION                     00084500
ENTYULOP CLC   RPEAUSR,ACEEUSRI    USER EXCEPTION?                      00084600
         BE    ENTYEXCP            MATCH, GO CHECK                      00084700
         ICM   R3,B'1111',RPEANEXT NEXT POINTER                         00084800
         BNZ   ENTYULOP            GO CHECK NEXT                        00084900
*                                                                       00085000
ENTYCONN ICM   R4,B'1111',ACEECGRP CONNECT GROUPS                       00085100
         BZ    ENTYUACC            NONE, GO ON                          00085200
         USING CONNGRUP,R4         ADDRESS IT                           00085300
ENTYCONL L     R3,RPEACCPT         GET POINTER AGAIN                    00085400
ENTYCON2 CLC   RPEAUSR,CONNGRPN    GROUP EXCEPTION?                     00085500
         BNE   ENTYNCRP            NO, NEXT RPE                         00085600
         OI    WORKFLAG,WORKOPRB   SET OPER BYPASS                      00085700
         CLC   WORKAUTH,RPEACS     SUFFICENT ACCESS IN PERMIT?          00085800
         BH    ENTYNCRP            NO, CHECK NEXT AUTH.                 00085900
         B     AUTHGOOD            YES, GO ON ...                       00086000
ENTYNCRP ICM   R3,B'1111',RPEANEXT NEXT POINTER                         00086100
         BNZ   ENTYCON2            GO CHECK NEXT EXCEPTION              00086200
ENTYNCON ICM   R4,B'1111',CONNNEXT NEXT POINTER                         00086300
         BNZ   ENTYCONL            GO CHECK NEXT CONNECT                00086400
         TM    WORKFLAG,WORKOPRB   BYPASS OPER CHECK?                   00086500
         BNO   ENTYUACC            NO, GO UACC                          00086600
         B     ENTYFAIL            ALL CONN.S FAILED                    00086700
*                                                                       00086800
ENTYUACC CLC   WORKAUTH,RPEUACC    SUFFICENT ACCESS IN UACC?            00086900
         BH    ENTYOPER            NO, RETURN CHECK FOR OP. AUTH        00087000
         B     AUTHGOOD            YES, GO ON ...                       00087100
*                                                                       00087200
ENTYEXCP CLC   WORKAUTH,RPEACS     SUFFICENT ACCESS IN PERMIT?          00087300
         BH    ENTYFAIL            NO, RETURN CHECK FOR OP. AUTH        00087400
         B     AUTHGOOD            YES, GO ON ...                       00087500
*---------------------------------------------------------------------* 00087600
*        Users with the OPERATIONS authority are permitted to         * 00087700
*        use all resources in the DATASET, DASDVOL and TAPEVOL class. * 00087800
*---------------------------------------------------------------------* 00087900
ENTYOPER CLC   =C'DATASET',RPECLASN  DATASET CLASS                      00088000
         BE    ENTYOPR2            YES, CHECK OPER AUTH                 00088100
         CLC   =C'DASDVOL',RPECLASN DASDVOL CLASS                       00088200
         BE    ENTYOPR2            YES, CHECK OPER AUTH                 00088300
         CLC   =C'TAPEVOL',RPECLASN TAPEVOL class?                 @rp2 00088400
         BE    ENTYOPR2            Yes: check operations privilege @rp2 00088500
         B     ENTYFAIL            TOUGH                                00088600
ENTYOPR2 TM    ACEEFLG1,ACEEOPER   MAKE OPER AUTH.                      00088700
         BNO   ENTYFAIL            TOUGH                                00088800
*                                                                       00088900
         DROP  R4,R3,R2            RPEACCLE CONNGRUP RPECBLK       @rp2 00089000
         CLC   =C'PROD',ACEEUSRI   PROD USERID?                         00089100
         BNE   AUTHGOOD            NO MSG NEC. -> OPER ALLOWED          00089200
         TM    WORKFLAG,WORKNLOG   NO LOG REQUESTED?                    00089300
         BO    AUTHGOOD            YES, NO MESS..                       00089400
         MVC   WORKWTO+4(60),WTOMSG7 INVALID ACCESS TO RESOURCE         00089500
         MVC   WORKWTO+4+WTOMSG7U(L'WTOMSG7U),ACEEUSRI MOVE USERID      00089600
         WTO   MF=(E,WORKWTO)      WRITE IT                             00089700
         MVC   WORKWTO+4(60),WTOMSGE ENTITY SKELETON                    00089800
         MVC   WORKWTO+4(9),=C'RAKF0006 ' USERID/CLASS                  00089900
         BAL   R4,ENTYENTY         ENTY COMMON                          00090000
         B     AUTHGOOD            ALLOW ACCESS                         00090100
*                                                                       00090200
ENTYERR1 MVC   WORKWTO+4(60),WTOMSG3 PROFS IN ERROR                     00090300
         MVC   WORKWTO+4+WTOMSG3U(L'WTOMSG3U),ACEEUSRI MOVE USERID      00090400
         WTO   MF=(E,WORKWTO)      WRITE IT                             00090500
         MVC   WORKWTO+4(60),WTOMSGE ENTITY SKELETON                    00090600
         MVC   WORKWTO+4(9),=C'RAKF0009 ' USERID/CLASS                  00090700
         BAL   R4,ENTYENTY         ENTY COMMON                          00090800
         B     AUTHGOOD            ALLOW ACCESS                         00090900
*                                                                       00091000
ENTYWARN OI    WORKENTY,4          RC = 4                               00091100
         TM    WORKFLAG,WORKNLOG   NO LOG REQUESTED?                    00091200
         BO    AUTHWARN            SORRY ....                           00091300
         MVC   WORKWTO+4(60),WTOMSG8 INVALID ACCESS TO RESOURCE         00091400
         WTO   MF=(E,WORKWTO)      WRITE IT                             00091500
         MVC   WORKWTO+4(60),WTOMSGE ENTITY SKELETON                    00091600
         MVC   WORKWTO+4(9),=C'RAKF000B ' USERID/CLASS                  00091700
         BAL   R4,ENTYENTY         ENTY COMMON                          00091800
         B     AUTHGOOD            ALLOW ACCESS                         00091900
*                                                                       00092000
ENTYFAIL OI    WORKENTY,8          RC = 8                               00092100
         TM    WORKFLAG,WORKNLOG   NO LOG REQUESTED?                    00092200
         BO    AUTHFAIL            SORRY ....                           00092300
         MVC   WORKWTO+4(60),WTOMSG5 INVALID ACCESS TO RESOURCE         00092400
         WTO   MF=(E,WORKWTO)      WRITE IT                             00092500
         MVC   WORKWTO+4(60),WTOMSGE ENTITY SKELETON                    00092600
         MVC   WORKWTO+4(9),=C'RAKF000A ' USERID/CLASS                  00092700
         BAL   R4,ENTYENTY         ENTY COMMON                          00092800
         B     AUTHFAIL            FAIL ACCESS                          00092900
*                                                                       00093000
ENTYENTY MVC   WORKWTO+4+WTOMSGEU(L'WTOMSGEU),ACEEUSRI MOVE USERID      00093100
         MVC   WORKWTO+4+WTOMSGEC(L'WTOMSGEC),WORKCLAS MOVE CLASS       00093200
         L     R2,PSAAOLD          ASCB ADDRESS                         00093300
         ICM   R3,B'1111',ASCBJBNI-ASCB(R2) JOBNAME SPEC.?              00093400
         BNZ   ENTYJOBN            YES, GO USE NAME                     00093500
         L     R3,ASCBJBNS-ASCB(R2) STC ... NAME                        00093600
ENTYJOBN MVC   WORKWTO+4+WTOMSGEJ(L'WTOMSGEJ),0(R3) MOVE JOBNAME        00093700
         XR    R1,R1               Entity length                   @rp2 00093800
         IC    R1,WORKENTL         Saved entity length             @rp2 00093900
         LTR   R1,R1               Length is zero?                 @rp2 00094000
         BZ    ENTYWTO1            Yes: assume some lengths        @rp2 00094100
         BCTR  R1,0                Minus 1 for EX                  @rp2 00094200
         B     ENTYWTO2            Set ENTITY in WTO               @rp2 00094300
ENTYWTO1 L     R1,WORKSTAT+4       Default entity len from RACSTAT @rp2 00094400
         BCTR  R1,0                Minus 1 for EX instruction      @rp2 00094500
         LA    R2,L'WTOMSGEE-1     Maximum room in WTO             @rp2 00094600
         CR    R2,R1               Too long?                       @rp2 00094700
         BH    ENTYWTO2            No: good                        @rp2 00094800
         LR    R1,R2               Yes: truncate                   @rp2 00094900
ENTYWTO2 EX    R1,ENTYERRX         MVC WORKWTO+4+WTOMSGEE(0),0(ENTYREG) 00095000
         WTO   MF=(E,WORKWTO)      WRITE IT                             00095100
         BR    R4                  RETURN                               00095200
*                                                                       00095300
ENTYERRX MVC   WORKWTO+4+WTOMSGEE(0),0(ENTYREG) MOVE ENTITY             00095400
*                                                                  @rp2 00095500
*        Report unknown CLASS                                      @rp2 00095600
*                                                                  @rp2 00095700
WTOUNKN  MVC   WORKWTO(REALWTOL),REALWTO Initialize WTO            @rp2 00095800
         MVC   WORKWTO+4(60),WTOMSG12 Move message                 @rp2 00095900
         MVC   WORKWTO+4+WTMSG12C(8),WORKCLAS   Move class name    @rp2 00096000
         WTO   MF=(E,WORKWTO)      Inform operator                 @rp2 00096100
         BR    R10                 Return                          @rp2 00096200
*                                                                       00096300
*                                                                       00096400
* Report when hardcoded STC account is used                             00096500
*                                                                       00096600
WTOSTC   MVC   WORKWTO(REALWTOL),REALWTO INIT WTO                       00096700
         MVC   WORKWTO+4(60),WTOMSG10 MOVE MESSAGE                      00096800
         ICM   R2,B'1111',X'C'(R8) GET STC PROC NAME PTR                00096900
         BZR   R10                 No proc name, no message        @rp2 00097000
         MVC   WORKWTO+4+WTMSG10P(8),0(R2) MOVE PROC NAME               00097100
WTOSTC1  WTO   MF=(E,WORKWTO)      ISSUE MESSAGE                        00097200
         BR    R10                 RETURN                               00097300
*                                                                       00097400
* Report when hardcoded PROD account is used                            00097500
*                                                                       00097600
WTOPROD  MVC   WORKWTO(REALWTOL),REALWTO INIT WTO                       00097700
         MVC   WORKWTO+4(60),WTOMSG11 MOVE MESSAGE                      00097800
         ICM   R2,B'1111',PSAAOLD  GET ASCB                             00097900
         BZ    WTOPROD1            NO ASCB                              00098000
         ICM   R2,B'1111',ASCBJBNI-ASCB(R2)  Point to jobname           00098100
         BZ    WTOPROD1            No Jobname                           00098200
         MVC   WORKWTO+4+WTMSG11J(8),0(R2) Move Jobname                 00098300
WTOPROD1 WTO   MF=(E,WORKWTO)      ISSUE MESSAGE                        00098400
         BR    R10                 RETURN                               00098500
*                                                                       00098600
         TITLE 'CONSTANTS AND SUCH'                                     00098700
         LTORG                                                          00098800
*                                                                       00098900
STCUID   DC    AL4(0),X'03',CL8'STC',X'08',C'STCGROUP'                  00099000
STCPASS  DC    X'08251C06253A1F362D',C'Y'                               00099100
STCGROUP DC    AL4(0),AL1(8),CL8'STCGROUP'                              00099200
PRODUID  DC    AL4(0),X'04',CL8'PROD',X'08',C'PRDGROUP'                 00099300
PRODPASS DC    X'08251C06253A1F362D',C'N'                               00099400
PRDGROUP DC    AL4(0),AL1(8),CL8'PRDGROUP'                              00099500
*                                                                       00099600
REALWTO  WTO   '1234567 101234567 201234567 301234567 401234567 5012345X00099700
               67 60',MF=L                                              00099800
REALWTOL EQU   *-REALWTO           LENGTH                               00099900
*                                                                       00100000
WTOMSG1  DC    CL60'RAKF0001 USERID TABLE INVALID OR MISSING'           00100100
WTOMSG2  DC    C'RAKF0002 STC ACCESS ALLOWED: USER:'                    00100200
WTOMSG2U EQU   *-WTOMSG2,8                                              00100300
         DC    CL8' ',CL(60-(*-WTOMSG2))' '                             00100400
WTOMSG3  DC    C'RAKF0003 RESOURCE TABLE INVALID/MISSING: ALLOWED:'     00100500
*        DC    C': USER ALLOWED:'                                       00100600
WTOMSG3U EQU   *-WTOMSG3,8                                              00100700
         DC    CL8' ',CL(60-(*-WTOMSG3))' '                             00100800
WTOMSG4  DC    C'RAKF0004 INVALID ATTEMPT TO ACCESS SYSTEM:  USER:'     00100900
WTOMSG4U EQU   *-WTOMSG4,8                                              00101000
         DC    CL8' ',CL(60-(*-WTOMSG4))' '                             00101100
WTOMSG5  DC    CL60'RAKF0005 INVALID ATTEMPT TO ACCESS RESOURCE'        00101200
WTOMSG7  DC    C'RAKF0007 ACCESS ALLOWED VIA OPERATIONS:  USER:'        00101300
WTOMSG7U EQU   *-WTOMSG7,8                                              00101400
         DC    CL8' ',CL(60-(*-WTOMSG7))' '                             00101500
WTOMSG8  DC    CL60'RAKF0008 UNDEFINED RESOURCE - ACCESS ALLOWED'       00101600
WTOMSG10 DC    C'RAKF0010I STC '                                        00101700
WTMSG10P EQU   *-WTOMSG10,8                                             00101800
         DC    CL8' ',C' STARTED USING DEFAULT STC ACCOUNT'             00101900
         DC    CL(60-(*-WTOMSG10))' '                                   00102000
WTOMSG11 DC    C'RAKF0011I JOB '                                        00102100
WTMSG11J EQU   *-WTOMSG11,8                                             00102200
         DC    CL8' ',C' STARTED USING DEFAULT PROD ACCOUNT'            00102300
         DC    CL(60-(*-WTOMSG11))' '                                   00102400
WTOMSG12 DC    C'RAKF0012 UNDEFINED CLASS '                        @rp2 00102500
WTMSG12C EQU   *-WTOMSG12,8                                        @rp2 00102600
         DC    CL8' '                  To contain unknown class    @rp2 00102700
         DC    CL(60-(*-WTOMSG12))' '                              @rp2 00102800
WTOMSGE  DC    C'XXXXXXXXX '                                            00102900
WTOMSGEU EQU   *-WTOMSGE,8                                              00103000
         DC    CL8' ',C','                                              00103100
WTOMSGEJ EQU   *-WTOMSGE,8                                              00103200
         DC    CL8' ',C','                                              00103300
WTOMSGEC EQU   *-WTOMSGE,8                                              00103400
         DC    CL8' ',C','                                              00103500
WTOMSGEE EQU   *-WTOMSGE,20                                             00103600
         DC    CL20' ',CL(60-(*-WTOMSGE))' '                            00103700
         DC    CL133' '                                                 00103800
*                                  spaceholder blanks removed       @02 00103900
         DC    CL23' '             rest of spaceholder blanks       @02 00104000
         TITLE 'REGISTERS AND SUCH'                                     00104100
R0       EQU   0                                                        00104200
R1       EQU   1                                                        00104300
R2       EQU   2                                                        00104400
R3       EQU   3                                                        00104500
R4       EQU   4                                                        00104600
R5       EQU   5                                                        00104700
ENTYREG  EQU   6                                                        00104800
ACEEREG  EQU   7                                                        00104900
R8       EQU   8                                                        00105000
R9       EQU   9                                                        00105100
R10      EQU   10                                                       00105200
R11      EQU   11                                                       00105300
R12      EQU   12                                                       00105400
R13      EQU   13                                                       00105500
R14      EQU   14                                                       00105600
R15      EQU   15                                                       00105700
         PRINT NOGEN                                                    00105800
         TITLE 'DSECTS AND SUCH'                                        00105900
*                                                                       00106000
*        WORKAREA is the area provided by the caller of                 00106100
*        RACROUTE (the WORKA paramer). The maximum length = 512 bytes   00106200
*                                                                       00106300
WORKAREA DSECT                     159 BYTE AREA                   @rp2 00106400
WORKSAVE DS    18F                 Our save area                        00106500
WORKSTAT DS    D                   Parameter for RACSTAT           @rp2 00106600
*                                  Word 1 = address of class name  @rp2 00106700
*                                  Word 2 = Max. length of class   @rp2 00106800
WORKWTO  DS    XL(REALWTOL)        FOR WTO                              00106900
WORKKEY  DS    X                   RACINIT KEY SAVE                     00107000
WORKENTY DS    X                   ENTITY RETURN                        00107100
WORKENTL DS    X                   Entity length                   @rp2 00107200
WORKFLAG DS    X                   FLAG BYTES                           00107300
WORKSUPO EQU   X'80'                  WE SET SUPERVISOR STATE           00107400
WORKNLOG EQU   X'40'                  NO LOG IF FAILURE                 00107500
WORKOPRB EQU   X'20'                  RPE MATCH ON USERID/CLASS         00107600
WORKPASS DS    XL9                 RACINIT LEN/PSWD                     00107700
         ORG   WORKPASS                                                 00107800
WORKCLAS DS    XL8                 RACHECK/DEF/FRAC CLASS               00107900
WORKAUTH DS    X                   RACHECK/DEF/FRAC AUTHORITY REQ.      00108000
         ORG                                                            00108100
         DS    XL(159-(*-WORKAREA)) MAKE SURE                      @rp2 00108200
WORKAREL EQU   *-WORKAREA           S.B 159                        @rp2 00108300
*                                                                       00108400
*        GETMAIN'd scratch for the RAKFPWH password-hash call           00108500
HASHWKD  DSECT                                                          00108600
HWPL     DS    5F                  Parmlist (salt,pw,pwlen,out,work)    00108700
HWPWLEN  DS    F                   Candidate password length            00108800
HWR13    DS    F                   Saved caller save-area pointer       00108900
HWOUT    DS    CL32                Computed SHA-256 hash                00109000
HWSAVE   DS    18F                 Save area for the RAKFPWH call       00109100
HWWORK   DS    CL640               RAKFPWH work area (>= RPWWORKL)      00109200
HASHWKL  EQU   *-HASHWKD           Total length to GETMAIN              00109300
*                                                                       00109400
AUTHDS   DSECT                     USED FOR RETURN FROM SUBS(R10)       00109500
AUTHGOOD DS    F'0'                                                     00109600
AUTHWARN DS    F'0'                                                     00109700
AUTHFAIL DS    F'0'                                                     00109800
*                                                                       00109900
         COPY  CJYUCBLK            USERID CBLK                          00110000
*                                                                       00110100
         COPY  CJYPCBLK            PROFILE CBLK                         00110200
*                                                                       00110300
         COPY  CJYRCVTD            RCVT CBLK                            00110400
*                                                                       00110500
         CVT     DSECT=YES,LIST=NO                                      00110600
         ICHACHKL                                                       00110700
         ICHPRCVT                                                       00110800
         ICHRDDFL                                                       00110900
         ICHSAFP                                                        00111000
         IEFAJCTB                                                       00111100
         IEZJSCB                                                        00111200
         IHAASCB DSECT=YES                                              00111300
         IHAASXB DSECT=YES                                              00111400
         IHACDE                                                         00111500
         IHAPSA  DSECT=YES                                              00111600
         IKJRB   DSECT=YES                                              00111700
         IKJTCB  DSECT=YES,LIST=NO                                      00111800
         IHAACEE                                                        00111900
ACEEL    EQU   *-ACEE                                                   00112000
         END                                                            00112100
